{
    "rarity": [
        {
            "description": "Standard",
            "valueModifier": 10,
            "slots": 4,
            "installationRemovalDC": "10",
            "modList": {
                "Lightweapon": [
                    {
                        "name": "Corruption Crystal (Novice)",
                        "description": "This weapon gains the corruption 13 property. If it already has the corruption property, its corruption number increases by 1, to a maximum of 18."
                    },
                    {
                        "name": "Bright Crystal (Novice)",
                        "description": "This weapon gains the bright 13 property. If it already has the bright property, its bright number increases by 1, to a maximum of 18."
                    },
                    {
                        "name": "Biting Crystal (Novice)",
                        "description": "This weapon gains the biting 13 property. If it already has the biting property, its biting number increases by 1, to a maximum of 18."
                    },
                    {"name": "Wrist Mount Hilt", "description": "This weapon gains the fixed property."}, {"name": "Withercasting Crystal (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Throwing Weapon Hilt (Basic)", "description": "This weapon gains thrown (10/30) property. If it already has the thrown property, the range increases by 5/15."}, {"name": "Stabilizer Training Cell", "description": "This weapon’s dexterity number is reduced by one step (from 21 to 19, 19 to 17, 17 to 15, 15 to 13, or 13 to 11). If the dexterity number is 11, this modification removes the dexterity property from it entirely."}, {"name": "Returning Weapon Hilt", "description": "Prerequisite: Thrown property\n \nThis weapon gains the returning property."}, {"name": "Rendcasting Crystal (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Ossus Training Lens", "description": "You gain a +1 bonus to attack rolls and a -1 penalty to damage rolls made with this weapon."}, {"name": "Magnetic-Lock Grip", "description": "While wielding this weapon, you have advantage on ability checks and saving throws made to disarm or avoid being disarmed."}, {"name": "Gloom Cell", "description": "This weapon loses the luminous property."}, {"name": "Fadecasting Crystal (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Disguised Hilt", "description": "This weapon gains the disguised property."}, {"name": "Disarming Cell", "description": "This weapon gains the disarming property."}, {"name": "Crystalizing Rangefinder (Training)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks and a -1 penalty to melee force attacks."}, {"name": "Crystalizing Amplifier (Training)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks and a -1 penalty to ranged force attacks."}, {"name": "Collapsible Hilt", "description": "This weapon gains the hidden property."}, {"name": "Burning Cell", "description": "When you score a critical hit with this weapon, you have advantage on the next attack roll you make against that creature before the end of your next turn."}, {"name": "Biometric Safety Measures", "description": "A security system is installed into the hilt of your lightweapon. When a creature other than you attempts to activate your lightweapon, the activation fails. Additionally, the creature attempting to activate it must make a DC 13 Constitution saving throw. On a failed save, a creature takes 1d10 lightning damage and is shocked until the end of its next turn. On a successful save the creature takes half damage and isn’t shocked. On a success or failure, the creature then drops the weapon."}, {"name": "Adegan Crystal (Cracked)", "description": "You gain a +1 bonus to damage rolls and a -1 penalty to attack rolls made with this weapon."}
                ],
                "Armor": [
                    {"name": "Withercasting Stitching Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Withercasting Inlay (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Threatening Pattern (Basic)", "description": "Your level of proficiency in Intimidation increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Techie's Pattern (Basic)", "description": "Your level of proficiency in Technology increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Survivalist's Pattern (Basic)", "description": "Your level of proficiency in Survival increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Strength Weave (Basic)", "description": "Your level of proficiency in Strength saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Stitching Rangefinder Mk I", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks and a -1 penalty to melee tech attacks."}, {"name": "Stitching Amplifier Mk I", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks and a -1 penalty to ranged tech attacks."}, {"name": "Stealthy Pattern (Basic)", "description": "Your level of proficiency in Stealth increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Silver-Tongued Pattern (Basic)", "description": "Your level of proficiency in Deception increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Rendcasting Stitching Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Rendcasting Inlay (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Reinforced Stitching (Basic)", "description": "You gain a +1 bonus to AC against ranged attacks and a -1 penalty to AC against melee attacks while wearing this clothing."}, {"name": "Quick-Fingered Pattern (Basic)", "description": "Your level of proficiency in Sleight of Hand increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Performer's Pattern (Basic)", "description": "Your level of proficiency in Performance increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Perceptive Pattern (Basic)", "description": "Your level of proficiency in Perception increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Naturalist's Pattern (Basic)", "description": "Your level of proficiency in Nature increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Medic's Pattern (Basic)", "description": "Your level of proficiency in Medicine increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Loremaster's Pattern (Basic)", "description": "Your level of proficiency in Lore increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Lightweight Weave", "description": "This clothing gains the lightweight armor property."}, {"name": "Investigator's Pattern (Basic)", "description": "Your level of proficiency in Investigation increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Intelligence Weave (Basic)", "description": "Your level of proficiency in Intelligence saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Insulated Pattern (Basic)", "description": "This clothing gains the insulated 5 armor property. If it already has the insulated armor property, its insulated number increases by 1, to a maximum of 10."}, {"name": "Inlay Rangefinder (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks and a -1 penalty to melee force attacks."}, {"name": "Inlay Amplifier (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks and a -1 penalty to ranged force attacks."}, {"name": "Impermeable Inlay (Basic)", "description": "This clothing gains the impermeable 2 armor property (suits chosen by the GM). If it already has the impermeable armor property, its impermeable number increases by 2, to a maximum of 9."}, {"name": "Fadecasting Stitching Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Fadecasting Inlay (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Empathic Pattern (Basic)", "description": "Your level of proficiency in Insight increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Clandestine Stitching (Basic)", "description": "This article of clothing come with one hidden pocket, which can store up to 1 lb. Finding this hidden pocket requires a DC 15 Investigation check."}, {"name": "Charmer's Pattern (Basic)", "description": "Your level of proficiency in Persuasion increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Charisma Weave (Basic)", "description": "Your level of proficiency in Charisma saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Brawny Pattern (Basic)", "description": "Your level of proficiency in Athletics increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Bonded Weave (Basic)", "description": "You gain a +1 bonus to AC against melee attacks and a -1 penalty to AC against ranged attacks while wearing this clothing."}, {"name": "Animal Handler's Pattern (Basic)", "description": "Your level of proficiency in Animal Handling increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Acrobat's Pattern (Basic)", "description": "Your level of proficiency in Acrobatics increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Ace Pilot's Pattern (Basic)", "description": "Your level of proficiency in Piloting increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}
                ],
                "Augment": [
                    {"name": "Wisdom Augment (Basic)", "description": "Your Wisdom score increases by 1. One ability score other than Wisdom (chosen by the GM) decreases by 1."}, {"name": "Strength Augment (Basic)", "description": "Your Strength score increases by 1. One ability score other than Strength (chosen by the GM) decreases by 1."}, {"name": "Intelligence Augment (Basic)", "description": "Your Intelligence score increases by 1. One ability score other than Intelligence (chosen by the GM) decreases by 1."}, {"name": "Dexterity Augment (Basic)", "description": "Your Dexterity score increases by 1. One ability score other than Dexterity (chosen by the GM) decreases by 1."}, {"name": "Constitution Augment (Basic)", "description": "Your Constitution score increases by 1. One ability score other than Constitution (chosen by the GM) decreases by 1."}, {"name": "Charisma Augment (Basic)", "description": "Your Charisma score increases by 1. One ability score other than Charisma (chosen by the GM) decreases by 1."}
                ],
                "Blaster": [
                    {"name": "Wrist Mount Attachment", "description": "This weapon gains the fixed property."}, {"name": "Withercasting Core (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Targeting Rangefinder (Training)", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks and a -1 penalty to melee tech attacks."}, {"name": "Targeting Amplifier (Training)", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks and a -1 penalty to ranged tech attacks."}, {"name": "Smart Interface (Basic)", "description": "This weapon gains the smart (15, +2) property. If it already has the smart property, its smart numbers increase by +1 and +1, respectively, to a maximum of 20 and +6."}, {"name": "Silencer", "description": "This weapon gains the silent property."}, {"name": "Siege Weapon", "description": "You modify this weapon to be more effective against barriers. The weapon deals double damage against structures."}, {"name": "Rendcasting Core (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Recoil Dampener", "description": "This weapon’s strength number is reduced by one step (from 21 to 19, 19 to 17, 17 to 15, 15 to 13, or 13 to 11). If the strength number is 11, this modification removes the strength property from it entirely."}, {"name": "Precision Chamber Mk I", "description": "This weapon’s range increases by 10/40."}, {"name": "Maser Core", "description": "When a creature tries to reduce the damage of a shot from this weapon with a feature or power, such as monk’s Deflect Missiles or the saber reflect force power, they have disadvantage on the reduction roll."}, {"name": "Focusing Scope", "description": "The simple scope allows you to use a bonus action to take aim at a target you can see. The next attack you make before the end of your next turn does not suffer disadvantage due to being made at long range."}, {"name": "Flashlight Attachment", "description": "You affix a targeted light to this weapon. As a bonus action, you can toggle the light on or off. While on, this weapon sheds bright light in a 60-foot cone."}, {"name": "Fadecasting Core (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Expanded Magazine", "description": "Once on each of your turns, you can reload this weapon once without using an action. You can’t use this feature again until you reload the weapon with an action."}, {"name": "Disintegration Core", "description": "This weapon gains the disintegrate 13 property. If it already has the disintegrate property, its disintegrate number increases by 1, to a maximum of 18."}, {"name": "Disguised Stock", "description": "This weapon gains the disguised property."}, {"name": "Corellian Crippler Matrix", "description": "Once per round, when you hit a creature with a ranged attack using this weapon, its speed is reduced by 5 feet until the end of its next turn."}, {"name": "Collapsible Stock", "description": "This weapon gains the hidden property."}, {"name": "Amplifying Barrel (Basic)", "description": "You gain a +1 bonus to damage rolls and a -1 penalty to attack rolls made with this weapon."}, {"name": "Accuracy Focus Mk I", "description": "You gain a +1 bonus to attack rolls and a -1 penalty to damage rolls made with this weapon."}
                ],
                "Clothing": [
                    {"name": "Withercasting Stitching Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Withercasting Inlay (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Threatening Pattern (Basic)", "description": "Your level of proficiency in Intimidation increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Techie's Pattern (Basic)", "description": "Your level of proficiency in Technology increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Survivalist's Pattern (Basic)", "description": "Your level of proficiency in Survival increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Strength Weave (Basic)", "description": "Your level of proficiency in Strength saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Stitching Rangefinder Mk I", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks and a -1 penalty to melee tech attacks."}, {"name": "Stitching Amplifier Mk I", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks and a -1 penalty to ranged tech attacks."}, {"name": "Stealthy Pattern (Basic)", "description": "Your level of proficiency in Stealth increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Silver-Tongued Pattern (Basic)", "description": "Your level of proficiency in Deception increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Rendcasting Stitching Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Rendcasting Inlay (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Reinforced Stitching (Basic)", "description": "You gain a +1 bonus to AC against ranged attacks and a -1 penalty to AC against melee attacks while wearing this clothing."}, {"name": "Quick-Fingered Pattern (Basic)", "description": "Your level of proficiency in Sleight of Hand increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Performer's Pattern (Basic)", "description": "Your level of proficiency in Performance increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Perceptive Pattern (Basic)", "description": "Your level of proficiency in Perception increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Naturalist's Pattern (Basic)", "description": "Your level of proficiency in Nature increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Medic's Pattern (Basic)", "description": "Your level of proficiency in Medicine increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Loremaster's Pattern (Basic)", "description": "Your level of proficiency in Lore increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Lightweight Weave", "description": "This clothing gains the lightweight armor property."}, {"name": "Investigator's Pattern (Basic)", "description": "Your level of proficiency in Investigation increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Intelligence Weave (Basic)", "description": "Your level of proficiency in Intelligence saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Insulated Pattern (Basic)", "description": "This clothing gains the insulated 5 armor property. If it already has the insulated armor property, its insulated number increases by 1, to a maximum of 10."}, {"name": "Inlay Rangefinder (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks and a -1 penalty to melee force attacks."}, {"name": "Inlay Amplifier (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks and a -1 penalty to ranged force attacks."}, {"name": "Impermeable Inlay (Basic)", "description": "This clothing gains the impermeable 2 armor property (suits chosen by the GM). If it already has the impermeable armor property, its impermeable number increases by 2, to a maximum of 9."}, {"name": "Fadecasting Stitching Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Fadecasting Inlay (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Empathic Pattern (Basic)", "description": "Your level of proficiency in Insight increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Clandestine Stitching (Basic)", "description": "This article of clothing come with one hidden pocket, which can store up to 1 lb. Finding this hidden pocket requires a DC 15 Investigation check."}, {"name": "Charmer's Pattern (Basic)", "description": "Your level of proficiency in Persuasion increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Charisma Weave (Basic)", "description": "Your level of proficiency in Charisma saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Brawny Pattern (Basic)", "description": "Your level of proficiency in Athletics increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Bonded Weave (Basic)", "description": "You gain a +1 bonus to AC against melee attacks and a -1 penalty to AC against ranged attacks while wearing this clothing."}, {"name": "Animal Handler's Pattern (Basic)", "description": "Your level of proficiency in Animal Handling increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Acrobat's Pattern (Basic)", "description": "Your level of proficiency in Acrobatics increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Ace Pilot's Pattern (Basic)", "description": "Your level of proficiency in Piloting increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}
                ],
                "Focus Generator": [
                    {"name": "Withercasting Channel (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "T-Cycle Reinforcer (Basic)", "description": "When you cast a force power that pushes or pulls a creature, you can increase the distance pushed or pulled by 5 feet."}, {"name": "Storing Emitter (Basic)", "description": "This item gains the storing 1 property. If it already has the storing property, its storing number increases by 1, to a maximum of 6."}, {"name": "Repelling Cycler (Cracked)", "description": "This item gains the repelling property."}, {"name": "Rendcasting Channel (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Mitigating Channel (Novice)", "description": "This item gains the mitigating 1 property. If it already has the mitigating property, its mitigating number increases by 1, to a maximum of 6."}, {"name": "Inflating Conductor (Cracked)", "description": "This item gains the inflating 5 property. If it already has the inflating property, its inflating number increases by 5, to a maximum of 30."}, {"name": "Increasing Cycler (Novice)", "description": "This item gains the increasing 10 property. If it already has the increasing property, its increasing number increases by 10, to a maximum of 60."}, {"name": "Focused Conductor", "description": "This item gains the focused property."}, {"name": "Fadecasting Channel (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Extending Cycler (Basic)", "description": "This item gains the extending 5 property. If it already has the extending property, its extending number increases by 5, to a maximum of 30."}, {"name": "Expanding Conductor (Basic)", "description": "This item gains the expanding 5 property. If it already has the expanding property, its expanding number increases by 5, to a maximum of 30."}, {"name": "Enlarging Channel (Cracked)", "description": "This item gains the enlarging 5 property. If it already has the enlarging property, its enlarging number increases by 5, to a maximum of 30."}, {"name": "Elongating Emitter (Novice)", "description": "This item gains the elongating 5 property. If it already has the elongating property, its elongating number increases by 5, to a maximum of 30."}, {"name": "Duplexed Extender Channel", "description": "When you cast a force power through this focus generator that has a range of 5 feet or greater, you can increase the range of that force power by 10 feet."}, {"name": "Dispelling Emitter (Basic)", "description": "This item gains the dispelling 1 property. If it already has the dispelling property, its dispelling number increases by 1, to a maximum of 6."}, {"name": "Constitution Emitter (Basic)", "description": "This item’s constitution number is reduced by one step (from 21 to 19, 19 to 17, 17 to 15, 15 to 13, or 13 to 11). If the constitution number is 11, this modification removes the constitution property from it entirely."}, {"name": "Channeling Rangefinder (Training)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks and a -1 penalty to melee force attacks."}, {"name": "Channeling Amplifier (Training)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks and a -1 penalty to ranged force attacks."}, {"name": "Bolstering Channel (Novice)", "description": "This item gains the bolstering 2 property. If it already has the bolstering property, its bolstering number increases by 2, to a maximum of 12."}, {"name": "Accessing Cycler (Cracked)", "description": "This item gains the accessing 1 property. If it already has the accessing property, its accessing number increases by 1, to a maximum of 6."}
                ],
                "Vibroweapon": [
                    {"name": "Wrist Mount Guard", "description": "This weapon gains the fixed property."}, {"name": "Withercasting Oscillator Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Withercasting Guard (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Throwing Weapon Guard (Basic)", "description": "This weapon gains thrown (10/30) property. If it already has the thrown property, the range increases by 5/15."}, {"name": "Staggering Oscillator", "description": "When you hit with the weapon, you can force the target to make a DC 13 Strength saving throw. On a failed save, the creature is pushed back 10 feet and knocked prone.\n Once you’ve used this feature, you must complete a short or long rest before you can use it again."}, {"name": "Sonorous Oscillator", "description": "This weapon gains the sonorous 13 property. If it already has the sonorous property, its sonorous number increases by 1, to a maximum of 18."}, {"name": "Shocking Oscillator", "description": "This weapon gains the shocking 13 property. If it already has the shocking property, its shocking number increases by 1, to a maximum of 18."}, {"name": "Rendcasting Oscillator Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Rendcasting Guard (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Oscillating Rangefinder Mk I", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks and a -1 penalty to melee tech attacks."}, {"name": "Oscillating Amplifier Mk I", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks and a -1 penalty to ranged tech attacks."}, {"name": "Neutronium Edge (Minor)", "description": "You gain a +1 bonus to damage rolls and a -1 penalty to attack rolls made with this weapon."}, {"name": "Neuralizing Oscillator", "description": "This weapon gains the neuralizing 13 property. If it already has the neuralizing property, its neuralizing number increases by 1, to a maximum of 18."}, {"name": "Nagai Edge (Basic)", "description": "When you have advantage on an attack roll you make with this weapon, get the same result on both dice rolls, and hit, you deal one additional weapon die worth of damage."}, {"name": "Guard Rangefinder (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks and a -1 penalty to melee force attacks."}, {"name": "Guard Amplifier (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks and a -1 penalty to ranged force attacks."}, {"name": "Flashlight Guard", "description": "You affix a targeted light to this weapon. As a bonus action, you can toggle the light on or off. While on, this weapon sheds bright light in a 60-foot cone."}, {"name": "Fadecasting Oscillator Mk I", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Fadecasting Guard (Novice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Disguised Guard", "description": "This weapon gains the disguised property."}, {"name": "Disarming Oscillator", "description": "This weapon gains the disarming property."}, {"name": "Contoured Grip (Basic)", "description": "You gain a +1 bonus to attack rolls and a -1 penalty to damage rolls made with this weapon."}, {"name": "Compensation Oscillator", "description": "This weapon’s dexterity number is reduced by one step (from 21 to 19, 19 to 17, 17 to 15, 15 to 13, or 13 to 11). If the dexterity number is 11, this modification removes the dexterity property from it entirely."}, {"name": "Collapsible Frame", "description": "This weapon gains the hidden property."}, {"name": "Celerity Oscillator", "description": "Once per turn, when you deal damage with this weapon, your walking speed increases by 10 feet until the start of your next turn, and the damaged creature can’t make opportunity attacks against you for the rest of your turn."}
                ],
                "Wristpad": [
                    {"name": "Withercasting Processor (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw and a -1 penalty to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Surging Processor Mk I", "description": "This item gains the surging 1 property. If it already has the surging property, its surging number increases by 1, to a maximum of 6."}, {"name": "Storing Dataport (Basic)", "description": "This item gains the storing 1 property. If it already has the storing property, its storing number increases by 1, to a maximum of 6."}, {"name": "Repelling Motherboard (Simple)", "description": "This item gains the repelling property."}, {"name": "Rendcasting Processor (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw and a -1 penalty to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Processing Rangefinder (Training)", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks and a -1 penalty to melee tech attacks."}, {"name": "Processing Amplifier (Training)", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks and a -1 penalty to ranged tech attacks."}, {"name": "Mitigating Processor Mk I", "description": "This item gains the mitigating 1 property. If it already has the mitigating property, its mitigating number increases by 1, to a maximum of 6."}, {"name": "MerenData Excelcior", "description": "When you deal cold damage to a creature with a tech power cast through this wristpad, the creature gains 1 slowed level until the end of its next turn."}, {"name": "Inflating Amplifier (Simple)", "description": "This item gains the inflating 5 property. If it already has the inflating property, its inflating number increases by 5, to a maximum of 30."}, {"name": "Increasing Motherboard Mk I", "description": "This item gains the increasing 10 property. If it already has the increasing property, its increasing number increases by 10, to a maximum of 60."}, {"name": "Focused Amplifier", "description": "This item gains the focused property."}, {"name": "Fadecasting Processor (Training)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw and a -1 penalty to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Extending Motherboard (Basic)", "description": "This item gains the extending 5 property. If it already has the extending property, its extending number increases by 5, to a maximum of 30."}, {"name": "Expanding Amplifier (Basic)", "description": "This item gains the expanding 5 property. If it already has the expanding property, its expanding number increases by 5, to a maximum of 30."}, {"name": "Enlarging Processor (Simple)", "description": "This item gains the enlarging 5 property. If it already has the enlarging property, its enlarging number increases by 5, to a maximum of 30."}, {"name": "Elongating Dataport Mk I", "description": "This item gains the elongating 5 property. If it already has the elongating property, its elongating number increases by 5, to a maximum of 30."}, {"name": "Dispelling Dataport (Basic)", "description": "This item gains the dispelling 1 property. If it already has the dispelling property, its dispelling number increases by 1, to a maximum of 6."}, {"name": "Constitution Dataport (Basic)", "description": "This item’s constitution number is reduced by one step (from 21 to 19, 19 to 17, 17 to 15, 15 to 13, or 13 to 11). If the constitution number is 11, this modification removes the constitution property from it entirely."}, {"name": "Accessing Motherboard (Simple)", "description": "This item gains the accessing 1 property. If it already has the accessing property, its accessing number increases by 1, to a maximum of 6."}, {"name": "Absorbing Amplifier Mk I", "description": "This item gains the absorbing 2 property. If it already has the absorbing property, its absorbing number increases by 2, to a maximum of 12."}
                ]
            }
        },
        {
            "description": "Premium",
            "valueModifier": 50,
            "slots": 4,
            "installationRemovalDC": "14",
            "modList": {
                "Armor": [
                    {"name": "Withercasting Underlay Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Overlay (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Versatile Shielding", "description": "Prerequiste: Shield\n This shield gains the versatile 1 property. If it already has the versatile property, its versatile number increases by 1, to a maximum of 3."}, {"name": "Underlay Rangefinder Mk II", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks."}, {"name": "Underlay Amplifier Mk II", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks."}, {"name": "Spiked Shielding", "description": "Prerequiste: Shield\n This shield gains the spiked (1d4) property. If it already has the spiked property, the spiked damage increases by one step (from d4 to d6, or from d6 to d8)."}, {"name": "Silent Armoring", "description": "Prerequisite: Armor\n \nThis armor gains the silent property."}, {"name": "Shield Anchor", "description": "Prerequisite: Physical shield\n \nThis shield gains the anchor property."}, {"name": "Responsive Shielding Mk I", "description": "Prerequiste: Shield\n This shield gains the responsive 1 property. If it already has the responsive property, its responsive number increases by 1, to a maximum of 3."}, {"name": "Rendcasting Underlay Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Overlay (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Reinforced Underlay (Fine)", "description": "You gain a +1 bonus to AC against ranged attacks while wearing this armor or wielding this shield."}, {"name": "Regulated Reinforcement", "description": "This armor or shield gains the regulated property."}, {"name": "Reactive Armoring", "description": "Prerequisite: Armor\n \nThis armor gains the reactive 1 property. If it already has the reactive property, its reactive number increases by 1, to a maximum of 3."}, {"name": "Powered Armoring Mk II", "description": "Prerequisite: Armor\n \nThis armor gains the powered 13 property. If it already has the powered property, its powered number increases by two steps (from 11 to 15, 13 to 17, 15 to 19, or 17 to 21)."}, {"name": "Overlay Rangefinder (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks."}, {"name": "Overlay Amplifier (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks."}, {"name": "Obscured Armoring", "description": "Prerequisite: Armor\n \nThis armor gains the obscured property."}, {"name": "Magnetized Shield (Fine)", "description": "Prerequisite: Physical shield\n \nThis shield gains the magnetic 14 property. If it already has the magnetic property, its magnetic number increases by 2, to a maximum of 18."}, {"name": "Interlocking Shielding", "description": "Prerequiste: Shield\n This shield gains the interlocking 1 property. If it already has the interlocking property, its interlocking number increases by 1, to a maximum of 3."}, {"name": "Insulated Reinforcement (Fine)", "description": "This armor or shield gains the insulated 6 property. If it already has the insulated property, its insulated number increases by 2, to a maximum of 10."}, {"name": "Impermeable Overlay Mk II", "description": "Prerequisite: Armor\n \nThis armor gains the impermeable 3 property (suits chosen by the GM). If it already has the impermeable property, its impermeable number increases by 3, to a maximum of 9."}, {"name": "Hydraulic Equalizer Mk II", "description": "This armor or shield’s strength number is reduced by two steps (from 21 to 17, 19 to 15, 17 to 13, or 15 to 11). If the strength number is 13 or lower, this modification removes the strength property from it entirely."}, {"name": "Horizontal Exojets", "description": "Prerequisite: Armor\n \nWhenever you take the Dodge or Dash actions, your walking speed increases by 10 feet until the end of your turn."}, {"name": "Heavy Suit", "description": "Prerequisite: Armor\n \nYou enhance this armor, making it difficult to move. As a bonus action, you can anchor or deanchor your feet to the ground. While anchored, your speed is 0, you have advantage on Strength checks and Strength saving throws, and your carrying capacity and the weight you can push, drag, or lift doubles. If it would already double, it instead triples."}, {"name": "Flexible Armoring", "description": "Prerequisite: Armor\n \nThis armor loses the rigid property."}, {"name": "Fadecasting Underlay Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Overlay (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Enhanced Endurance", "description": "Prerequisite: Armor\n \nWhen you are reduced to 0 hit points while wearing this armor but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."}, {"name": "Darkvision Visor", "description": "Prerequisite: Armor\n \nWhile wearing this armor, you have darkvision to a range of 60 feet. If you already have darkvision, this modification increases its range by 30 feet."}, {"name": "Convenience Reinforcement", "description": "This armor or shield loses the cumbersome property."}, {"name": "Concealing Shielding", "description": "Prerequiste: Shield\n This shield gains the concealing property."}, {"name": "Collapsible Suit", "description": "This armor can collapse into a case for easy storage. When transformed this way the armor is indistinguishable from a normal case and weighs 1/3 its normal weight. As an action you can don or doff the armor, allowing it to transform as needed."}, {"name": "Charging Reinforcement", "description": "This armor or shield gains the charging 1 property. If it already has the charging property, its charging property increases by 1, to a maximum of 3."}, {"name": "Bonded Plates Mk II", "description": "You gain a +1 bonus to AC against melee attacks while wearing this armor or wielding this shield."}, {"name": "Bioenhancement Matrix Mk I", "description": "Your hit point maximum increases by an amount equal to your level, and it increases by 1 every time you gain a level."}, {"name": "Barbed Armoring", "description": "Prerequisite: Armor\n \nThis armor gains the barbed (1d4) property. If it already has the barbed property, the barbed damage increases by one step (from d4 to d6, or from d6 to d8)."}, {"name": "Balanced Shielding", "description": "Prerequiste: Shield\n This shield loses the imbalanced property."}, {"name": "Avoidant Reinforcement", "description": "This armor or shield gains the avoidant 1 property. If it already has the avoidant property, its avoidant number increases by 1, to a maximum of 3."}, {"name": "Agile Armoring Mk II", "description": "Prerequisite: Armor\n \nThis armor gains the agile 13 property. If it already has the agile property, its agile number increases by two steps (from 11 to 15, 13 to 17, 15 to 19, or 17 to 21)."}, {"name": "Absorptive Reinforcement", "description": "This armor or shield gains the absorptive 1 property. If it already has the absorptive property, its absorptive property increases by 1, to a maximum of 3."}
                ],
                "Augment": [
                    {"name": "Wisdom Augment (Fine)", "description": "Your Wisdom score increases by 1."}, {"name": "Strength Augment (Fine)", "description": "Your Strength score increases by 1."}, {"name": "Intelligence Augment (Fine)", "description": "Your Intelligence score increases by 1."}, {"name": "Dexterity Augment (Fine)", "description": "Your Dexterity score increases by 1."}, {"name": "Constitution Augment (Fine)", "description": "Your Constitution score increases by 1."}, {"name": "Charisma Augment (Fine)", "description": "Your Charisma score increases by 1."}
                ],
                "Blaster": [
                    {"name": "Withercasting Core (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Vicious Fighting Core", "description": "This weapon gains the vicious 1 property. If it already has the vicious property, its vicious number increases by 1, to a maximum of 3."}, {"name": "Targeting Rangefinder (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks."}, {"name": "Targeting Amplifier (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks."}, {"name": "Smart Interface (Fine)", "description": "This weapon gains the smart (16, +2) property. If it already has the smart property, its smart numbers increase by +2 and +1, respectively, to a maximum of 20 and +6."}, {"name": "Rendcasting Core (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Recoil Dampener (Fine)", "description": "This weapon’s strength number is reduced by two steps (from 21 to 17, 19 to 15, 17 to 13, or 15 to 11). If the strength number is 13 or lower, this modification removes the strength property from it entirely."}, {"name": "Rapid Core", "description": "Prerequisite: Blaster that uses cells or cartridges\n \nThis weapon gains the rapid property, with a rapid number equal to one-half its reload number (rounded up), to a minimum of 2. If it already has the rapid property, the rapid number is reduced to one-fourth its reload number (rounded up), to a minimum of 2."}, {"name": "Precision Chamber Mk II", "description": "This weapon’s range increases by 20/80."}, {"name": "Piercing Core", "description": "This weapon gains the piercing 1 property. If it already has the piercing property, its piercing number increases by 1, to a maximum of 3."}, {"name": "Mighty Core", "description": "Prerequisite: Lacks strength property\n \nThis weapon gains the mighty property."}, {"name": "Light Core", "description": "This weapon gains the light property."}, {"name": "Keen Core", "description": "This weapon gains the keen 1 property. If it already has the keen property, its keen number increases by 1, to a maximum of 3."}, {"name": "Ion Amplifying Core", "description": "Prerequisite: Ion damage\n \nThis weapon ignores resistance to ion damage."}, {"name": "Fadecasting Core (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Expanded Magazine (Fine)", "description": "Once on each of your turns, you can reload this weapon once without using an action. You can use this feature twice times. You regain all expended uses when you reload the weapon with an action."}, {"name": "Disruption Core", "description": "This weapon gains the disruptive property."}, {"name": "Disintegration Core Mk II", "description": "This weapon gains the disintegrate 14 property. If it already has the disintegrate property, its disintegrate number increases by 2, to a maximum of 18."}, {"name": "Dire Fighting Scope", "description": "This weapon gains the dire 1 property. If it already has the dire property, its dire number increases by 1, to a maximum of 3."}, {"name": "Burst Core", "description": "Prerequisite: Blaster that uses cells or cartridges\n \nThis weapon gains the burst property, with a burst number equal to its reload number, minimum of 2. If it already has the burst property, the burst number is reduced to one-half its reload number (rounded up), to a minimum of 2."}, {"name": "Brutal Scope", "description": "This weapon gains the brutal 1 property. If it already has the brutal property, its brutal number increases by 1, to a maximum of 3."}, {"name": "Bayonet", "description": "You affix a short blade to the barrel of this weapon, allowing you to make a melee weapon attack with it. The blade is a melee weapon with the finesse property that you are proficient with, and deals 1d6 kinetic damage."}, {"name": "Amplifying Barrel (Fine)", "description": "You gain a +1 bonus to damage rolls made with this weapon."}, {"name": "Accuracy Focus Mk II", "description": "You gain a +1 bonus to attack rolls made with this weapon."}
                ],
                "Clothing": [
                    {"name": "Withercasting Stitching Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Inlay (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Wisdom Weave (Fine)", "description": "Your level of proficiency in Wisdom saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Threatening Pattern (Fine)", "description": "Your level of proficiency in Intimidation increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Techie's Pattern (Fine)", "description": "Your level of proficiency in Technology increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Survivalist's Pattern (Fine)", "description": "Your level of proficiency in Survival increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Stitching Rangefinder Mk II", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks."}, {"name": "Stitching Amplifier Mk II", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks."}, {"name": "Stealthy Pattern (Fine)", "description": "Your level of proficiency in Stealth increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Silver-Tongued Pattern (Fine)", "description": "Your level of proficiency in Deception increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Silent Stitching", "description": "This clothing gains the silent armor property."}, {"name": "Rendcasting Stitching Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Inlay (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Reinforced Stitching (Fine)", "description": "You gain a +1 bonus to AC against ranged attacks while wearing this clothing."}, {"name": "Regulated Weave", "description": "This clothing gains the regulated armor property."}, {"name": "Reactive Stitching (Adequate)", "description": "This clothing gains the reactive 1 armor property. If it already has the reactive armor property, its reactive number increases by 1, to a maximum of 3."}, {"name": "Quick-Fingered Pattern (Fine)", "description": "Your level of proficiency in Sleight of Hand increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Performer's Pattern (Fine)", "description": "Your level of proficiency in Performance increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Perceptive Pattern (Fine)", "description": "Your level of proficiency in Perception increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Obscured Stitching", "description": "This clothing gains the obscured armor property."}, {"name": "Naturalist's Pattern (Fine)", "description": "Your level of proficiency in Nature increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Medic's Pattern (Fine)", "description": "Your level of proficiency in Medicine increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Loremaster's Pattern (Fine)", "description": "Your level of proficiency in Lore increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Investigator's Pattern (Fine)", "description": "Your level of proficiency in Investigation increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Insulated Pattern (Fine)", "description": "This clothing gains the insulated 6 armor property. If it already has the insulated armor property, its insulated number increases by 2, to a maximum of 10."}, {"name": "Inlay Rangefinder (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks."}, {"name": "Inlay Amplifier (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks."}, {"name": "Impermeable Inlay (Fine)", "description": "This clothing gains the impermeable 3 armor property (suits chosen by the GM). If it already has the impermeable armor property, its impermeable number increases by 3, to a maximum of 9."}, {"name": "Fadecasting Stitching Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Inlay (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Empathic Pattern (Fine)", "description": "Your level of proficiency in Insight increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Dexterity Weave (Fine)", "description": "Your level of proficiency in Dexterity saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Constitution Weave (Fine)", "description": "Your level of proficiency in Constitution saving throws increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery)."}, {"name": "Clandestine Stitching (Fine)", "description": "This article of clothing come with two hidden pockets, each of which can store up to 1 lb. Finding these hidden pockets requires a DC 18 Investigation check."}, {"name": "Charmer's Pattern (Fine)", "description": "Your level of proficiency in Persuasion increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Brawny Pattern (Fine)", "description": "Your level of proficiency in Athletics increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Bonded Weave (Fine)", "description": "You gain a +1 bonus to AC against melee attacks while wearing this clothing."}, {"name": "Avoidant Weave (Basic)", "description": "This clothing gains the avoidant 1 armor property. If it already has the avoidant armor property, its avoidant number increases by 1, to a maximum of 3."}, {"name": "Animal Handler's Pattern (Fine)", "description": "Your level of proficiency in Animal Handling increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Acrobat's Pattern (Fine)", "description": "Your level of proficiency in Acrobatics increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Ace Pilot's Pattern (Fine)", "description": "Your level of proficiency in Piloting increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}
                ],
                "Focus Generator": [
                    {"name": "Withering Channel (Fighting)", "description": "This item gains the withering 1 property. If it already has the withering property, its withering number increases by 1, to a maximum of 3."}, {"name": "Withercasting Channel (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "T-Cycle Reinforcer (Improved)", "description": "When you cast a force power that pushes or pulls a creature, you can increase the distance pushed or pulled by 10 feet."}, {"name": "Storing Emitter (Fine)", "description": "This item gains the storing 2 property. If it already has the storing property, its storing number increases by 2, to a maximum of 6."}, {"name": "Repelling Cycler (Chipped)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + your proficiency bonus + your casting modifier for that power, whichever is greater."}, {"name": "Rending Conductor (Fighting)", "description": "This item gains the rending 1 property. If it already has the rending property, its rending number increases by 1, to a maximum of 3."}, {"name": "Rendcasting Channel (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Ranging Emitter (Fighting)", "description": "This item gains the ranging 1 property. If it already has the ranging property, its ranging number increases by 1, to a maximum of 3."}, {"name": "Mitigating Channel (Apprentice)", "description": "This item gains the mitigating 2 property. If it already has the mitigating property, its mitigating number increases by 2, to a maximum of 6."}, {"name": "Inflating Conductor (Chipped)", "description": "This item gains the inflating 10 property. If it already has the inflating property, its inflating number increases by 10, to a maximum of 30."}, {"name": "Increasing Cycler (Apprentice)", "description": "This item gains the increasing 20 property. If it already has the increasing property, its increasing number increases by 20, to a maximum of 60."}, {"name": "Forged Ferricite Fighting Channel", "description": "When you cast a force power of 1st-level or higher that deals damage, you can increase the damage by half (rounded down) the number of force points spent."}, {"name": "Fading Cycler (Fighting)", "description": "This item gains the fading 1 property. If it already has the fading property, its fading number increases by 1, to a maximum of 3."}, {"name": "Fadecasting Channel (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Extending Cycler (Fine)", "description": "This item gains the extending 10 property. If it already has the extending property, its extending number increases by 10, to a maximum of 30."}, {"name": "Expanding Conductor (Fine)", "description": "This item gains the expanding 10 property. If it already has the expanding property, its expanding number increases by 10, to a maximum of 30."}, {"name": "Enlarging Channel (Chipped)", "description": "This item gains the enlarging 10 property. If it already has the enlarging property, its enlarging number increases by 10, to a maximum of 30."}, {"name": "Elongating Emitter (Apprentice)", "description": "This item gains the elongating 10 property. If it already has the elongating property, its elongating number increases by 10, to a maximum of 30."}, {"name": "Duplexed Extender Channel (Fine)", "description": "When you cast a force power through this focus generator that has a range of 5 feet or greater, you can increase the range of that force power by 20 feet."}, {"name": "Dispelling Emitter (Fine)", "description": "This item gains the dispelling 2 property. If it already has the dispelling property, its dispelling number increases by 2, to a maximum of 6."}, {"name": "Constitution Emitter (Fine)", "description": "This item’s constitution number is reduced by two steps (from 21 to 17, 19 to 15, 17 to 13, or 15 to 11). If the constitution number is 13 or lower, this modification removes the constitution property from it entirely."}, {"name": "Channeling Rangefinder (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks."}, {"name": "Channeling Amplifier (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks."}, {"name": "Bolstering Channel (Apprentice)", "description": "This item gains the bolstering 4 property. If it already has the bolstering property, its bolstering number increases by 4, to a maximum of 12."}, {"name": "Amplifying Channel (Fighting)", "description": "This item gains the amplifying 1 property. If it already has the amplifying property, its amplifying number increases by 1, to a maximum of 3."}, {"name": "Accessing Cycler (Chipped)", "description": "This item gains the accessing 2 property. If it already has the accessing property, its accessing number increases by 2, to a maximum of 6."}, {"name": "Absorbing Conductor (Apprentice)", "description": "This item gains the absorbing 4 property. If it already has the absorbing property, its absorbing number increases by 4, to a maximum of 12."}
                ],
                "Lightweapon": [
                    {"name": "Withercasting Crystal (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Vicious Fighting Hilt", "description": "This weapon gains the vicious 1 property. If it already has the vicious property, its vicious number increases by 1, to a maximum of 3."}, {"name": "Versatile Handle", "description": "Prerequisite: Lacks double or two-handed property\n \nThis weapon gains the versatile (1d10) property. If it already has the versatile property, the versatile damage increases by one step (from 2d4 to d10, d10 to d12, from d12 to 2d6, or from 2d6 to 3d4)."}, {"name": "Ventilation Stabilizer", "description": "When you take the Attack action and hit a creature with this weapon, you can repeat the attack against another creature within 5 feet, no action required. Once you’ve used this feature, you must complete a short or long rest before you can use it again."}, {"name": "Throwing Weapon Hilt (Fine)", "description": "This weapon gains thrown (20/60) property. If it already has the thrown property, the range increases by 10/30."}, {"name": "Stabilizer Fighting Cell", "description": "This weapon’s dexterity number is reduced by two steps (from 21 to 17, 19 to 15, 17 to 13, or 15 to 11). If the dexterity number is 13 or lower, this modification removes the dexterity property from it entirely."}, {"name": "Rendcasting Crystal (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Piercing Cell", "description": "This weapon gains the piercing 1 property. If it already has the piercing property, its piercing number increases by 1, to a maximum of 3."}, {"name": "Ossus Fighting Lens", "description": "You gain a +1 bonus to attack rolls made with this weapon."}, {"name": "Light Cell", "description": "This weapon gains the light property."}, {"name": "Keen Beam", "description": "This weapon gains the keen 1 property. If it already has the keen property, its keen number increases by 1, to a maximum of 3."}, {"name": "Hilt Blaster", "description": "You convert this weapon’s hilt into a small blaster. The blaster is a ranged weapon with the range 20/60 and reload 6 properties that you are proficient with, and deals 1d4 energy damage."}, {"name": "Helisaber Attachment", "description": "Prerequisite: Double property\n \nAs a bonus action, you can activate the attachment. While active, you have a 30-foot flying speed, and whenever you take damage you must make a concentration check as if concentrating on a power. On a failure, you immediately fall to the ground."}, {"name": "Heavy Cell", "description": "This weapon gains the heavy property."}, {"name": "Fadecasting Crystal (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Disruption Cell", "description": "This weapon gains the disruptive property."}, {"name": "Dire Fighting Hilt", "description": "This weapon gains the dire 1 property. If it already has the dire property, its dire number increases by 1, to a maximum of 3."}, {"name": "Crystalizing Rangefinder (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks."}, {"name": "Crystalizing Amplifier (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks."}, {"name": "Crossguard Hilt", "description": "This weapon gains the defensive 1 property. If it already has the defensive property, its defensive number increases by 1, to a maximum of 3."}, {"name": "Corruption Crystal (Apprentice)", "description": "This weapon gains the corruption 14 property. If it already has the corruption property, its corruption number increases by 2, to a maximum of 18."}, {"name": "Comfortable Handle", "description": "Prerequisite: Lacks dexterity, two-handed, or versatile property\n \nThis weapon gains the finesse property."}, {"name": "Brutal Cell", "description": "This weapon gains the brutal 1 property. If it already has the brutal property, its brutal number increases by 1, to a maximum of 3."}, {"name": "Bright Crystal (Apprentice)", "description": "This weapon gains the bright 14 property. If it already has the bright property, its bright number increases by 2, to a maximum of 18."}, {"name": "Biting Crystal (Apprentice)", "description": "This weapon gains the biting 14 property. If it already has the biting property, its biting number increases by 2, to a maximum of 18."}, {"name": "Adegan Crystal (Chipped)", "description": "You gain a +1 bonus to damage rolls made with this weapon."}
                ],
                "Vibroweapon": [
                    {"name": "Withercasting Oscillator Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Guard (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Vicious Fighting Guard", "description": "This weapon gains the vicious 1 property. If it already has the vicious property, its vicious number increases by 1, to a maximum of 3."}, {"name": "Versatile Frame", "description": "Prerequisite: Lacks double or two-handed property\n \nThis weapon gains the versatile (1d10) property. If it already has the versatile property, the versatile damage increases by one step (from 2d4 to d10, d10 to d12, from d12 to 2d6, or from 2d6 to 3d4)."}, {"name": "Throwing Weapon Guard (Fine)", "description": "This weapon gains thrown (20/60) property. If it already has the thrown property, the range increases by 10/30."}, {"name": "Sonorous Oscillator Mk II", "description": "This weapon gains the sonorous 14 property. If it already has the sonorous property, its sonorous number increases by 2, to a maximum of 18."}, {"name": "Shocking Oscillator Mk II", "description": "This weapon gains the shocking 14 property. If it already has the shocking property, its shocking number increases by 2, to a maximum of 18."}, {"name": "Rendcasting Oscillator Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Guard (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Piercing Oscillator", "description": "This weapon gains the piercing 1 property. If it already has the piercing property, its piercing number increases by 1, to a maximum of 3."}, {"name": "Pacnorval Chem Integrator", "description": "You can apply poisons to this weapon as a bonus action, instead of an action."}, {"name": "Oscillating Rangefinder Mk II", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks."}, {"name": "Oscillating Amplifier Mk II", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks."}, {"name": "Neutronium Edge (Average)", "description": "You gain a +1 bonus to damage rolls made with this weapon."}, {"name": "Neuralizing Oscillator Mk II", "description": "This weapon gains the neuralizing 14 property. If it already has the neuralizing property, its neuralizing number increases by 2, to a maximum of 18."}, {"name": "Monomolecular Oscillator Mk I", "description": "This weapon ignores resistance to kinetic damage."}, {"name": "Light Oscillator", "description": "This weapon gains the light property."}, {"name": "Keen Oscillator", "description": "This weapon gains the keen 1 property. If it already has the keen property, its keen number increases by 1, to a maximum of 3."}, {"name": "Heavy Oscillator", "description": "This weapon gains the heavy property."}, {"name": "Guard Rangefinder (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to ranged force attacks."}, {"name": "Guard Amplifier (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to melee force attacks."}, {"name": "Finesse Oscillator", "description": "Prerequisite: Lacks dexterity, two-handed, or versatile property\n \nThis weapon gains the finesse property."}, {"name": "Fadecasting Oscillator Mk II", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Guard (Apprentice)", "description": "While using this item as your focus, you gain a +1 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Disruption Oscillator", "description": "This weapon gains the disruptive property."}, {"name": "Dire Fighting Guard", "description": "This weapon gains the dire 1 property. If it already has the dire property, its dire number increases by 1, to a maximum of 3."}, {"name": "Defensive Guard", "description": "This weapon gains the defensive 1 property. If it already has the defensive property, its defensive number increases by 1, to a maximum of 3."}, {"name": "Contoured Grip (Fine)", "description": "You gain a +1 bonus to attack rolls made with this weapon."}, {"name": "Compensation Oscillator (Fine)", "description": "This weapon’s dexterity number is reduced by two steps (from 21 to 17, 19 to 15, 17 to 13, or 15 to 11). If the dexterity number is 13 or lower, this modification removes the dexterity property from it entirely."}, {"name": "Brutal Oscillator", "description": "This weapon gains the brutal 1 property. If it already has the brutal property, its brutal number increases by 1, to a maximum of 3."}
                ],
                "Wristpad": [
                    {"name": "Pinpoint Subroutine", "description": "When you cast a power that allows you to force creatures in an area to make a saving throw you can instead spend 1 tech point and make a ranged tech attack against a single target that would be in the range. On a hit the target suffers the effects as though they failed their saving throw.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Improved Subroutine", "description": "When you roll damage for a power, you can spend 1 additional tech point to reroll a number of the damage dice up to your Intelligence modifier (minimum of one). You must use the new rolls.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use Improved Subroutine even if you have already used a different Subroutine modification during the casting of the power."}, {"name": "Extended Subroutine", "description": "When you cast a power that has a duration of 1 minute or longer, you can spend 1 additional tech point to double its duration, to a maximum duration of 24 hours.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Distant Subroutine", "description": "When you cast a power that has a range of 5 feet or greater, you can spend 1 additional tech point to double the range of the power.\n Alternatively, when you cast a power that has a range of touch, you can spend 1 additional tech point to make the range of the power 30 feet.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Careful Subroutine", "description": "When you cast a power that forces other creatures to make a saving throw, you can protect some of those creatures from the power’s full force. To do so, you spend 1 additional tech point and choose a number of those creatures up to your Intelligence modifier (minimum of one). A chosen creature automatically succeeds on its saving throw against the power.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Withering Processor (Fighting)", "description": "This item gains the withering 1 property. If it already has the withering property, its withering number increases by 1, to a maximum of 3."}, {"name": "Withercasting Processor (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Surging Processor Mk II", "description": "This item gains the surging 2 property. If it already has the surging property, its surging number increases by 2, to a maximum of 6."}, {"name": "Storing Dataport (Fine)", "description": "This item gains the storing 2 property. If it already has the storing property, its storing number increases by 2, to a maximum of 6."}, {"name": "Repelling Motherboard (Adequate)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + your proficiency bonus + your casting modifier for that power, whichever is greater."}, {"name": "Rending Amplifier (Fighting)", "description": "This item gains the rending 1 property. If it already has the rending property, its rending number increases by 1, to a maximum of 3."}, {"name": "Rendcasting Processor (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Ranging Dataport (Fighting)", "description": "This item gains the ranging 1 property. If it already has the ranging property, its ranging number increases by 1, to a maximum of 3."}, {"name": "Processing Rangefinder (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to ranged tech attacks."}, {"name": "Processing Amplifier (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to melee tech attacks."}, {"name": "Mitigating Processor Mk II", "description": "This item gains the mitigating 2 property. If it already has the mitigating property, its mitigating number increases by 2, to a maximum of 6."}, {"name": "Inflating Amplifier (Adequate)", "description": "This item gains the inflating 10 property. If it already has the inflating property, its inflating number increases by 10, to a maximum of 30."}, {"name": "Increasing Motherboard Mk II", "description": "This item gains the increasing 20 property. If it already has the increasing property, its increasing number increases by 20, to a maximum of 60."}, {"name": "Fading Motherboard (Fighting)", "description": "This item gains the fading 1 property. If it already has the fading property, its fading number increases by 1, to a maximum of 3."}, {"name": "Fadecasting Processor (Fighting)", "description": "While using this item as your focus, you gain a +1 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Extending Motherboard (Fine)", "description": "This item gains the extending 10 property. If it already has the extending property, its extending number increases by 10, to a maximum of 30."}, {"name": "Expanding Amplifier (Fine)", "description": "This item gains the expanding 10 property. If it already has the expanding property, its expanding number increases by 10, to a maximum of 30."}, {"name": "Enlarging Processor (Adequate)", "description": "This item gains the enlarging 10 property. If it already has the enlarging property, its enlarging number increases by 10, to a maximum of 30."}, {"name": "Elongating Dataport Mk II", "description": "This item gains the elongating 10 property. If it already has the elongating property, its elongating number increases by 10, to a maximum of 30."}, {"name": "Dispelling Dataport (Fine)", "description": "This item gains the dispelling 2 property. If it already has the dispelling property, its dispelling number increases by 2, to a maximum of 6."}, {"name": "Constitution Dataport (Fine)", "description": "This item’s constitution number is reduced by two steps (from 21 to 17, 19 to 15, 17 to 13, or 15 to 11). If the constitution number is 13 or lower, this modification removes the constitution property from it entirely."}, {"name": "Bansche Purifier MENAD Pro Mk I", "description": "When you cast a tech power with this wristpad that gives you a bonus to AC or saving throws, you can increase that bonus by +1."}, {"name": "Amplifying Processor (Fighting)", "description": "This item gains the amplifying 1 property. If it already has the amplifying property, its amplifying number increases by 1, to a maximum of 3."}, {"name": "Accessing Motherboard (Adequate)", "description": "This item gains the accessing 2 property. If it already has the accessing property, its accessing number increases by 2, to a maximum of 6."}, {"name": "Absorbing Amplifier Mk II", "description": "This item gains the absorbing 4 property. If it already has the absorbing property, its absorbing number increases by 4, to a maximum of 12."}
                ]
            }
        },
        {
            "description": "Prototype",
            "valueModifier": 250,
            "slots": 5,
            "installationRemovalDC": "18",
            "modList": {
                "Armor": [
                    {"name": "Withercasting Underlay Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Overlay (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Viir Agathys's Armoring", "description": "Prerequisite: Armor\n \nThis armor has 3 charges. As an action, you can spend 1 or more charges to cast the voltaic shielding tech power, 1 charge per level. All expended charges are regained after you complete a long rest.\n This armoring grants access to renowned engineer Viir Agathys’s signature tech power."}, {"name": "Underlay Rangefinder Mk III", "description": "While using this item as your focus, you gain a +2 bonus to ranged tech attacks."}, {"name": "Underlay Amplifier Mk III", "description": "While using this item as your focus, you gain a +2 bonus to melee tech attacks."}, {"name": "Rendcasting Underlay Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Overlay (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Reinforced Underlay (Improved)", "description": "You gain a +2 bonus to AC against ranged attacks while wearing this armor or wielding this shield."}, {"name": "Powered Armoring Mk III", "description": "Prerequisite: Armor\n \nThis armor gains the powered 15 property. If it already has the powered property, its powered number increases by three steps (from 11 to 17, 13 to 19, or 15 to 21)."}, {"name": "Overlay Rangefinder (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to ranged force attacks."}, {"name": "Overlay Amplifier (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to melee force attacks."}, {"name": "Magnetized Shield (Improved)", "description": "Prerequisite: Physical shield\n \nThis shield gains the magnetic 15 property. If it already has the magnetic property, its magnetic number increases by 3, to a maximum of 18."}, {"name": "Integrated Jetboosters Mk I", "description": "Prerequisite: Armor\n \nThis armor has a jetpack built in. Activating or deactivating the jetpack requires a bonus action and, while active, you have a flying speed of 30 feet. The jetpack last for 1 minute per power cell (to a maximum of 10 minutes) and can be recharged by a power source or replacing the power cells."}, {"name": "Insulated Reinforcement (Improved)", "description": "This armor or shield gains the insulated 7 property. If it already has the insulated property, its insulated number increases by 3, to a maximum of 10."}, {"name": "Impermeable Overlay Mk III", "description": "Prerequisite: Armor\n \nThis armor gains the impermeable 5 property (suits chosen by the GM). If it already has the impermeable property, its impermeable number increases by 5, to a maximum of 9."}, {"name": "Hydraulic Equalizer Mk III", "description": "This armor or shield’s strength number is reduced by three steps (from 21 to 15, 19 to 13, or 17 to 11). If the strength number is 15 or lower, this modification removes the strength property from it entirely."}, {"name": "Grappling Harpoon", "description": "Prerequisite: Armor\n \nThis armor gains an integrated grappling harpoon set into your gauntlet. With this harpoon, you can make a ranged weapon attack with a range of 30/60. On a hit, it deals 1d6 kinetic damage. This attack can target a surface, object, or creature.\n A creature struck by this attack is impaled by the harpoon. As an action, a creature can attempt to remove the harpoon. Removing the harpoon requires a DC 15 Strength check. While the harpoon is stuck in the target, you are connected to the target by a 60 foot cable.\n While the harpoon is deployed, you can use your bonus action to activate the reel, pulling yourself to the location if the target is larger than you. A creature or object your size or smaller is pulled to you. Alternatively, you can opt to release the cable (no action required).\n Once you’ve used this feature, you can’t use it again until you recover and reinsert the harpoon as an action."}, {"name": "Gauntlet Armoring Mk II", "description": "Prerequisite: Armor\n \nThis armor gains the gauntleted (1d6) property. If it already has the gauntleted property, the gauntleted damage increases by two steps (from d4 to d8)."}, {"name": "Fadecasting Underlay Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Overlay (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Cortosis Weave", "description": "This armor or shield gains the absorptive 1 property. If it already has the absorptive property, its absorptive property increases by 1, to a maximum of 3. Additionally, when taking energy damage from a lightweapon, this armor or shield’s absorptive number is doubled, to a maximum of 6."}, {"name": "Bonded Plates Mk III", "description": "You gain a +2 bonus to AC against melee attacks while wearing this armor or wielding this shield."}, {"name": "Ballistic Polymer", "description": "While you have temporary hit points, kinetic and energy damage you take is reduced by an amount equal to half your proficiency bonus (rounded up)."}, {"name": "Artificially Intelligent", "description": "Prerequisite: Armor\n \nYou install an artificial intelligence into this armor. While wearing this armor, when you make an ability check, this armor’s artificial intelligence can take the Help action.\n You can use this feature twice. You regain all expended uses when you complete a short or long rest."}, {"name": "Agile Armoring Mk III", "description": "Prerequisite: Armor\n \nThis armor gains the agile 15 property. If it already has the agile property, its agile number increases by three steps (from 11 to 17, 13 to 19, or 15 to 21)."}, {"name": "Constitution Dataport (Fine)", "description": "This item’s constitution number is reduced by two steps (from 21 to 17, 19 to 15, 17 to 13, or 15 to 11). If the constitution number is 13 or lower, this modification removes the constitution property from it entirely."}, {"name": "Bansche Purifier MENAD Pro Mk I", "description": "When you cast a tech power with this wristpad that gives you a bonus to AC or saving throws, you can increase that bonus by +1."}, {"name": "Amplifying Processor (Fighting)", "description": "This item gains the amplifying 1 property. If it already has the amplifying property, its amplifying number increases by 1, to a maximum of 3."}, {"name": "Accessing Motherboard (Adequate)", "description": "This item gains the accessing 2 property. If it already has the accessing property, its accessing number increases by 2, to a maximum of 6."}, {"name": "Absorbing Amplifier Mk II", "description": "This item gains the absorbing 4 property. If it already has the absorbing property, its absorbing number increases by 4, to a maximum of 12."}
                ],
                "Augment": [
                    {"name": "Wisdom Augment (Improved)", "description": "Your Wisdom score increases by 1, and your maximum for this score increases by 1. One ability score other than Wisdom (chosen by the GM) decreases by 1."}, {"name": "Strength Augment (Improved)", "description": "Your Strength score increases by 1, and your maximum for this score increases by 1. One ability score other than Strength (chosen by the GM) decreases by 1."}, {"name": "Sentinel Offensive Augment", "description": "Prerequisite: At least 3 levels in sentinel\n \nYou learn an additional Sentinel Ideal option."}, {"name": "Sentinel Defensive Augment", "description": "Prerequisite: At least 3 levels in sentinel\n \nYou gain an additional manifestation use of your Sentinel Ideals."}, {"name": "Scout Offensive Augment", "description": "Prerequisite: At least 3 levels in scout\n \nYou can apply the additional damage from your Ranger’s Quarry feature one additional time per turn."}, {"name": "Scout Defensive Augment", "description": "Prerequisite: At least 3 levels in scout\n \nYou learn an additional Scout Routine option, and the radius of your Scout Routines increases by 5 feet."}, {"name": "Scholar Offensive Augment", "description": "Prerequisite: At least 3 levels in scholar\n \nYou learn an additional maneuver, and you gain one additional superiority die."}, {"name": "Scholar Defensive Augment", "description": "Prerequisite: At least 3 levels in scholar\n \nYou learn an additional discovery. When you complete a long rest, you can change this discovery for a different option available to you."}, {"name": "Operative Offensive Augment", "description": "Prerequisite: At least 3 levels in operative\n \nYour Sneak Attack damage die increases by one step (from d6 to a d8, d8 to d10, or d10 to d12)."}, {"name": "Operative Defensive Augment", "description": "Prerequisite: At least 3 levels in operative\n \nYou learn an additional Operative Exploit option."}, {"name": "Monk Offensive Augment", "description": "Prerequisite: At least 3 levels in monk\n \nWhen you roll a 1 on the damage roll for an unarmed strike or monk weapon, you can reroll the die. You must use the new roll."}, {"name": "Monk Defensive Augment", "description": "Prerequisite: At least 3 levels in monk\n \nYou gain one Monastic Vow option."}, {"name": "Intelligence Augment (Improved)", "description": "Your Intelligence score increases by 1, and your maximum for this score increases by 1. One ability score other than Intelligence (chosen by the GM) decreases by 1."}, {"name": "Guardian Offensive Augment", "description": "Prerequisite: At least 3 levels in guardian\n \nThe damage die for your Focused Strike die and Improved Force-Empowered Strikes features increases by one step (from d8 to d10, or d10 to d12)."}, {"name": "Guardian Defensive Augment", "description": "Prerequisite: At least 3 levels in guardian\n \nYou learn an additional Guardian Aura option, and the radius of your Guardian Auras increases by 5 feet."}, {"name": "Fighter Offensive Augment", "description": "Prerequisite: At least 3 levels in fighter\n \nYou learn an additional maneuver, and you gain one additional superiority die."}, {"name": "Fighter Defensive Augment", "description": "Prerequisite: At least 3 levels in fighter\n \nWhen you use your Second Wind feature, you also gain temporary hit points equal to the amount of hit points you regain."}, {"name": "Engineer Offensive Augment", "description": "Prerequisite: At least 3 levels in engineer\n \nWhen you use your Potent Aptitude feature, you can target an additional creature within 60 feet of you who can hear you and grant them a Potent Aptitude die as well without expending an additional use."}, {"name": "Engineer Defensive Augment", "description": "Prerequisite: At least 3 levels in engineer\n \nThis item becomes a valid target of the Infuse Item feature if it wasn’t already, granting a bonus appropriate to the item’s type. Additionally, you gain an additional use of your Potent Aptitude."}, {"name": "Dexterity Augment (Improved)", "description": "Your Dexterity score increases by 1, and your maximum for this score increases by 1. One ability score other than Dexterity (chosen by the GM) decreases by 1."}, {"name": "Consular Offensive Augment", "description": "Prerequisite: At least 3 levels in consular\n \nYou learn an additional Force-Empowered Casting option."}, {"name": "Consular Defensive Augment", "description": "Prerequisite: At least 3 levels in consular\n \nWhen you roll initiative and have no uses of your Force Shield left, you regain one use."}, {"name": "Constitution Augment (Improved)", "description": "Your Constitution score increases by 1, and your maximum for this score increases by 1. One ability score other than Constitution (chosen by the GM) decreases by 1."}, {"name": "Charisma Augment (Improved)", "description": "Your Charisma score increases by 1, and your maximum for this score increases by 1. One ability score other than Charisma (chosen by the GM) decreases by 1."}, {"name": "Berserker Offensive Augment", "description": "Prerequisite: At least 3 levels in berserker\n \nYour Rage damage bonus increases by 1, and when you score a critical hit, you can roll one additional weapon damage die and add the result to the total."}, {"name": "Berserker Defensive Augment", "description": "Prerequisite: At least 3 levels in berserker\n \nYou learn an additional Berserker Instinct option."}, {"name": "Bansche Purifier MENAD Pro Mk I", "description": "When you cast a tech power with this wristpad that gives you a bonus to AC or saving throws, you can increase that bonus by +1."}, {"name": "Amplifying Processor (Fighting)", "description": "This item gains the amplifying 1 property. If it already has the amplifying property, its amplifying number increases by 1, to a maximum of 3."}, {"name": "Accessing Motherboard (Adequate)", "description": "This item gains the accessing 2 property. If it already has the accessing property, its accessing number increases by 2, to a maximum of 6."}, {"name": "Absorbing Amplifier Mk II", "description": "This item gains the absorbing 4 property. If it already has the absorbing property, its absorbing number increases by 4, to a maximum of 12."}
                ],
                "Blaster": [
                    {"name": "Withercasting Core (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Targeting Rangefinder (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to ranged tech attacks."}, {"name": "Targeting Amplifier (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to melee tech attacks."}, {"name": "Smart Interface (Improved)", "description": "This weapon gains the smart (17, +3) property. If it already has the smart property, its smart numbers increase by +3 and +2, respectively, to a maximum of 20 and +6."}, {"name": "Semiauto Core", "description": "Prerequisite: Auto property\n \nThis weapon loses the auto property."}, {"name": "Rylith Power Core", "description": "When you take the Attack action and hit a target with a ranged attack with this weapon, you can repeat the attack against another creature up to 15 feet from the target in a direct line from you (no action required). Once you’ve used this feature, you must complete a short or long rest before you can use it again."}, {"name": "Rendcasting Core (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Recoil Dampener (Improved)", "description": "This weapon’s strength number is reduced by three steps (from 21 to 15, 19 to 13, or 17 to 11). If the strength number is 15 or lower, this modification removes the strength property from it entirely."}, {"name": "Quantum Splitter Mk I", "description": "When you deal damage with this weapon, you can roll a d4 and add the result to the total."}, {"name": "Precision Chamber Mk III", "description": "This weapon’s range increases by 30/120."}, {"name": "Harpoon Reel Attachment", "description": "You install a secondary firemode that launches a harpoon attached to a tightly coiled cord. With this harpoon, you can make a ranged weapon attack with a range of 30/60. On a hit, it deals 1d6 kinetic damage. This attack can target a surface, object, or creature.\n A creature struck by this attack is impaled by the harpoon. As an action, a creature can attempt to remove the harpoon. Removing the harpoon requires a DC 15 Strength check. While the harpoon is stuck in the target, you are connected to the target by a 60 foot cable.\n While connected in this manner, you can use your bonus action to activate the reel, pulling yourself to the location if the target is your size or larger. A creature or object smaller than you is pulled to you. Alternatively, you can opt to release the cable (no action required).\n Once you’ve used this feature, you can’t use it again until you recover and reinsert the harpoon as an action."}, {"name": "Fadecasting Core (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Expanded Magazine (Improved)", "description": "Once on each of your turns, you can reload this weapon once without using an action. You can use this feature three times. You regain all expended uses when you reload the weapon with an action."}, {"name": "Disintegration Core Mk III", "description": "This weapon gains the disintegrate 15 property. If it already has the disintegrate property, its disintegrate number increases by 3, to a maximum of 18."}, {"name": "Amplifying Barrel (Improved)", "description": "You gain a +2 bonus to damage rolls made with this weapon."}, {"name": "Accuracy Focus Mk III", "description": "You gain a +2 bonus to attack rolls made with this weapon."}
                ],
                "Clothing": [
                    {"name": "Withercasting Stitching Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Inlay (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Threatening Pattern (Favored)", "description": "Your level of proficiency in Intimidation increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Techie's Pattern (Favored)", "description": "Your level of proficiency in Technology increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Survivalist's Pattern (Favored)", "description": "Your level of proficiency in Survival increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Strength Weave (Improved)", "description": "Your level of proficiency in Strength saving throws increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Stitching Rangefinder Mk III", "description": "While using this item as your focus, you gain a +2 bonus to ranged tech attacks."}, {"name": "Stitching Amplifier Mk III", "description": "While using this item as your focus, you gain a +2 bonus to melee tech attacks."}, {"name": "Stealthy Pattern (Favored)", "description": "Your level of proficiency in Stealth increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Silver-Tongued Pattern (Favored)", "description": "Your level of proficiency in Deception increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Rendcasting Stitching Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Inlay (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Reinforced Stitching (Improved)", "description": "You gain a +2 bonus to AC against ranged attacks while wearing this clothing."}, {"name": "Quick-Fingered Pattern (Favored)", "description": "Your level of proficiency in Sleight of Hand increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Performer's Pattern (Favored)", "description": "Your level of proficiency in Performance increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Perceptive Pattern (Favored)", "description": "Your level of proficiency in Perception increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Naturalist's Pattern (Favored)", "description": "Your level of proficiency in Nature increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Medic's Pattern (Favored)", "description": "Your level of proficiency in Medicine increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Loremaster's Pattern (Favored)", "description": "Your level of proficiency in Lore increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Investigator's Pattern (Favored)", "description": "Your level of proficiency in Investigation increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Intelligence Weave (Improved)", "description": "Your level of proficiency in Intelligence saving throws increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Insulated Pattern (Improved)", "description": "This clothing gains the insulated 7 armor property. If it already has the insulated armor property, its insulated number increases by 3, to a maximum of 10."}, {"name": "Inlay Rangefinder (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to ranged force attacks."}, {"name": "Inlay Amplifier (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to melee force attacks."}, {"name": "Impermeable Inlay (Improved)", "description": "This clothing gains the impermeable 5 armor property (suits chosen by the GM). If it already has the impermeable armor property, its impermeable number increases by 5, to a maximum of 9."}, {"name": "Fadecasting Stitching Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Inlay (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Empathic Pattern (Favored)", "description": "Your level of proficiency in Insight increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Clandestine Stitching (Improved)", "description": "This article of clothing come with three hidden pockets, each of which can store up to 1 lb. Finding these hidden pockets requires a DC 21 Investigation check."}, {"name": "Charmer's Pattern (Favored)", "description": "Your level of proficiency in Persuasion increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Charisma Weave (Improved)", "description": "Your level of proficiency in Charisma saving throws increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Brawny Pattern (Favored)", "description": "Your level of proficiency in Athletics increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Bonded Weave (Favored)", "description": "You gain a +2 bonus to AC against melee attacks while wearing this clothing."}, {"name": "Animal Handler's Pattern (Favored)", "description": "Your level of proficiency in Animal Handling increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Acrobat's Pattern (Favored)", "description": "Your level of proficiency in Acrobatics increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Ace Pilot's Pattern (Favored)", "description": "Your level of proficiency in Piloting increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}
                ],
                "Focus Generator": [
                    {"name": "Withercasting Channel (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Storing Emitter (Improved)", "description": "This item gains the storing 3 property. If it already has the storing property, its storing number increases by 3, to a maximum of 6."}, {"name": "Repelling Cycler (Flawed)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater."}, {"name": "Rendcasting Channel (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Phobium Echoer (Improved)", "description": "When you cast a force power that affects an area in a radius or a cube, you can increase the radius or length of the cube by 5 feet."}, {"name": "Mitigating Channel (Journeyman)", "description": "This item gains the mitigating 3 property. If it already has the mitigating property, its mitigating number increases by 3, to a maximum of 6."}, {"name": "Inflating Conductor (Flawed)", "description": "This item gains the inflating 15 property. If it already has the inflating property, its inflating number increases by 15, to a maximum of 30."}, {"name": "Increasing Cycler (Journeyman)", "description": "This item gains the increasing 30 property. If it already has the increasing property, its increasing number increases by 30, to a maximum of 60."}, {"name": "Forged Ferricite Dueling Channel", "description": "When you cast a force power of 1st-level or higher that deals damage, you can increase the damage by the number of force points spent."}, {"name": "Fadecasting Channel (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Extending Cycler (Improved)", "description": "This item gains the extending 15 property. If it already has the extending property, its extending number increases by 15, to a maximum of 30."}, {"name": "Expanding Conductor (Improved)", "description": "This item gains the expanding 15 property. If it already has the expanding property, its expanding number increases by 15, to a maximum of 30."}, {"name": "Enlarging Channel (Flawed)", "description": "This item gains the enlarging 15 property. If it already has the enlarging property, its enlarging number increases by 15, to a maximum of 30."}, {"name": "Elongating Emitter (Journeyman)", "description": "This item gains the elongating 15 property. If it already has the elongating property, its elongating number increases by 15, to a maximum of 30."}, {"name": "Dispelling Emitter (Improved)", "description": "This item gains the dispelling 3 property. If it already has the dispelling property, its dispelling number increases by 3, to a maximum of 6."}, {"name": "Constitution Emitter (Improved)", "description": "This item’s constitution number is reduced by three steps (from 21 to 15, 19 to 13, or 17 to 11). If the constitution number is 15 or lower, this modification removes the constitution property from it entirely."}, {"name": "Channeling Rangefinder (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to ranged force attacks."}, {"name": "Channeling Amplifier (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to melee force attacks."}, {"name": "Bolstering Channel (Journeyman)", "description": "This item gains the bolstering 6 property. If it already has the bolstering property, its bolstering number increases by 6, to a maximum of 12."}, {"name": "Accessing Cycler (Flawed)", "description": "This item gains the accessing 3 property. If it already has the accessing property, its accessing number increases by 3, to a maximum of 6."}, {"name": "Absorbing Conductor (Journeyman)", "description": "This item gains the absorbing 6 property. If it already has the absorbing property, its absorbing number increases by 6, to a maximum of 12."}
                ],
                "Lightweapon": [
                    {"name": "Withercasting Crystal (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Throwing Weapon Hilt (Improved)", "description": "This weapon gains thrown (30/90) property. If it already has the thrown property, the range increases by 15/45."}, {"name": "Stabilizer Dueling Cell", "description": "This weapon’s dexterity number is reduced by three steps (from 21 to 15, 19 to 13, or 17 to 11). If the dexterity number is 15 or lower, this modification removes the dexterity property from it entirely."}, {"name": "Rendcasting Crystal (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Ossus Dueling Lens", "description": "You gain a +2 bonus to attack rolls made with this weapon."}, {"name": "Fadecasting Crystal (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Damind Crystal (Flawed)", "description": "When you deal damage with this weapon, you can roll a d4 and add the result to the total."}, {"name": "Crystalizing Rangefinder (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to ranged force attacks."}, {"name": "Crystalizing Amplifier (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to melee force attacks."}, {"name": "Corruption Crystal (Journeyman)", "description": "This weapon gains the corruption 15 property. If it already has the corruption property, its corruption number increases by 3, to a maximum of 18."}, {"name": "Bright Crystal (Journeyman)", "description": "This weapon gains the bright 15 property. If it already has the bright property, its bright number increases by 3, to a maximum of 18."}, {"name": "Biting Crystal (Journeyman)", "description": "This weapon gains the biting 15 property. If it already has the biting property, its biting number increases by 3, to a maximum of 18."}, {"name": "Adegan Crystal (Flawed)", "description": "You gain a +2 bonus to damage rolls made with this weapon."}
                ],
                "Vibroweapon": [
                    {"name": "Withercasting Oscillator Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Guard (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Venomous Oscillator", "description": "As a bonus action, you can coat this weapon in a thin layer of poison for 1 minute. The next time you hit with the weapon, the creature must make a DC 15 Constitution saving throw. On a failed save, a creature takes 1d10 poison damage and becomes poisoned for 1 minute.\n Once you’ve used this feature, you must complete a long rest before you can use it again."}, {"name": "Throwing Weapon Guard (Improved)", "description": "This weapon gains thrown (30/90) property. If it already has the thrown property, the range increases by 15/45."}, {"name": "Sonorous Oscillator Mk III", "description": "This weapon gains the sonorous 15 property. If it already has the sonorous property, its sonorous number increases by 3, to a maximum of 18."}, {"name": "Shocking Oscillator Mk III", "description": "This weapon gains the shocking 15 property. If it already has the shocking property, its shocking number increases by 3, to a maximum of 18."}, {"name": "Serrated Edge Mk I", "description": "When you deal damage with this weapon, you can roll a d4 and add the result to the total."}, {"name": "Rendcasting Oscillator Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Guard (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Oscillating Rangefinder Mk III", "description": "While using this item as your focus, you gain a +2 bonus to ranged tech attacks."}, {"name": "Oscillating Amplifier Mk III", "description": "While using this item as your focus, you gain a +2 bonus to melee tech attacks."}, {"name": "Neutronium Edge (Major)", "description": "You gain a +2 bonus to damage rolls made with this weapon."}, {"name": "Neuralizing Oscillator Mk III", "description": "This weapon gains the neuralizing 15 property. If it already has the neuralizing property, its neuralizing number increases by 3, to a maximum of 18."}, {"name": "Nagai Edge (Improved)", "description": "When you have advantage on an attack roll you make with this weapon, get the same result on both dice rolls, and hit, you deal two additional weapon dice worth of damage."}, {"name": "Harpoon Reel Guard", "description": "You install a secondary firemode that launches a harpoon attached to a tightly coiled cord. With this harpoon, you can make a ranged weapon attack with a range of 30/60. On a hit, it deals 1d6 kinetic damage. This attack can target a surface, object, or creature.\n A creature struck by this attack is impaled by the harpoon. As an action, a creature can attempt to remove the harpoon. Removing the harpoon requires a DC 15 Strength check. While the harpoon is stuck in the target, you are connected to the target by a 60 foot cable.\n While connected in this manner, you can use your bonus action to activate the reel, pulling yourself to the location if the target is your size or larger. A creature or object smaller than you is pulled to you. Alternatively, you can opt to release the cable (no action required).\n Once you’ve used this feature, you can’t use it again until you recover and reinsert the harpoon as an action."}, {"name": "Guard Rangefinder (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to ranged force attacks."}, {"name": "Guard Amplifier (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to melee force attacks."}, {"name": "Fadecasting Oscillator Mk III", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Guard (Journeyman)", "description": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Electrifying Oscillator", "description": "When you hit with the weapon, you can create an electronic burst. Each creature in a 15-foot cone centered on the creature you hit must make a DC 15 Dexterity saving throw, taking 1d8 lightning damage on a failed save or half as much on a successful one.\n Once you’ve used this feature, you must complete a long rest before you can use it again."}, {"name": "Contoured Grip (Improved)", "description": "You gain a +2 bonus to attack rolls made with this weapon."}, {"name": "Compensation Oscillator (Improved)", "description": "This weapon’s dexterity number is reduced by three steps (from 21 to 15, 19 to 13, or 17 to 11). If the dexterity number is 15 or lower, this modification removes the dexterity property from it entirely."}
                ],
                "Wristpad": [
                    {"name": "Twinned Subroutine", "description": "When you cast a power that can only have one target and doesn’t have a range of self, you can spend a number of additional tech points equal to the power’s level to choose a second target in range with the same power (1 tech point if the power is at-will).\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Seeking Subroutine", "description": "If you miss with a tech power that calls for an attack roll, you can spend 2 tech points to reroll the attack. You must use the new roll.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use Seeking Subroutine even if you have already used a different Subroutine modificatio during the casting of the power."}, {"name": "Refocused Subroutine", "description": "When you are forced to make a Constitution saving throw to maintain concentration on a power you can use your reaction and spend 2 tech points to automatically succeed on the saving throw.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use Refocused Subroutine even if you have already used a different Subroutine modification during the casting of the power."}, {"name": "Quickened Subroutine", "description": "When you cast a power that has a casting time of 1 action, you can spend 2 additional tech points to change the casting time to 1 bonus action for this casting.\n You can only spend a number of tech points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Lingering Subroutine", "description": "WWhen you cast a power that requires concentration to maintain you can choose to spend 3 additional tech points. If you do, when you lose concentration on the power, the power will not end until the end of your next turn.\n You can only spend a number of tech points in this way equal to your proficiency bonus (minimum of once). You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Heightened Subroutine", "description": "When you cast a power that forces a creature to make a saving throw to resist its effects, you can spend 3 additional tech points to give one target of the power disadvantage on its first saving throw made against the power.\n You can only spend a number of tech points in this way equal to your proficiency bonus (minimum of once). You regain the ability to do so when you complete a long rest.\n You can use only one Subroutine modification on a power when you cast it, unless otherwise noted."}, {"name": "Withercasting Processor (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Surging Processor Mk III", "description": "This item gains the surging 3 property. If it already has the surging property, its surging number increases by 3, to a maximum of 6."}, {"name": "Storing Dataport (Improved)", "description": "This item gains the storing 3 property. If it already has the storing property, its storing number increases by 3, to a maximum of 6."}, {"name": "Sienar Starfire X-Force Mk I", "description": "When you spend tech points to cast a tech power that restores hit points to a creature, the creature gains a number of temporary hit points equal to the number of tech points spent."}, {"name": "Repelling Motherboard (Leading)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater."}, {"name": "Rendcasting Processor (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Processing Rangefinder (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to ranged tech attacks."}, {"name": "Processing Amplifier (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to melee tech attacks."}, {"name": "Mitigating Processor Mk III", "description": "This item gains the mitigating 3 property. If it already has the mitigating property, its mitigating number increases by 3, to a maximum of 6."}, {"name": "Inflating Amplifier (Leading)", "description": "This item gains the inflating 15 property. If it already has the inflating property, its inflating number increases by 15, to a maximum of 30."}, {"name": "Increasing Motherboard Mk III", "description": "This item gains the increasing 30 property. If it already has the increasing property, its increasing number increases by 30, to a maximum of 60."}, {"name": "Fadecasting Processor (Dueling)", "description": "While using this item as your focus, you gain a +2 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Extending Motherboard (Improved)", "description": "This item gains the extending 15 property. If it already has the extending property, its extending number increases by 15, to a maximum of 30."}, {"name": "Expanding Amplifier (Improved)", "description": "This item gains the expanding 15 property. If it already has the expanding property, its expanding number increases by 15, to a maximum of 30."}, {"name": "Enlarging Processor (Leading)", "description": "This item gains the enlarging 15 property. If it already has the enlarging property, its enlarging number increases by 15, to a maximum of 30."}, {"name": "Elongating Dataport Mk III", "description": "This item gains the elongating 15 property. If it already has the elongating property, its elongating number increases by 15, to a maximum of 30."}, {"name": "Dispelling Dataport (Improved)", "description": "This item gains the dispelling 3 property. If it already has the dispelling property, its dispelling number increases by 3, to a maximum of 6."}, {"name": "Constitution Dataport (Improved)", "description": "This item’s constitution number is reduced by three steps (from 21 to 15, 19 to 13, or 17 to 11). If the constitution number is 15 or lower, this modification removes the constitution property from it entirely."}, {"name": "Bansche Advanced 2ZBc", "description": "When you spend tech points and deal damage with a tech power cast through this wristpad, you deal additional damage equal to the number of tech points spent."}, {"name": "Accessing Motherboard (Leading)", "description": "This item gains the accessing 3 property. If it already has the accessing property, its accessing number increases by 3, to a maximum of 6."}, {"name": "Absorbing Amplifier Mk III", "description": "This item gains the absorbing 6 property. If it already has the absorbing property, its absorbing number increases by 6, to a maximum of 12."}
                ]
            }
        },
        {
            "description": "Advanced",
            "valueModifier": 1000,
            "slots": 5,
            "installationRemovalDC": "22",
            "modList": {
                "Armor": [
                    {"name": "Withercasting Underlay Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Overlay (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Versatile Shielding Mk II", "description": "Prerequiste: Shield\n This shield gains the versatile 2 property. If it already has the versatile property, its versatile number increases by 2, to a maximum of 3."}, {"name": "Underlay Rangefinder Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to ranged tech attacks."}, {"name": "Underlay Amplifier Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to melee tech attacks."}, {"name": "Spiked Shielding Mk II", "description": "Prerequiste: Shield\n This shield gains the spiked (1d6) property. If it already has the spiked property, the spiked damage increases by two steps (from d4 to d8)."}, {"name": "Responsive Shielding Mk II", "description": "Prerequiste: Shield\n This shield gains the responsive 2 property. If it already has the responsive property, its responsive number increases by 2, to a maximum of 3."}, {"name": "Rendcasting Underlay Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Overlay (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Reinforced Underlay (Superior)", "description": "You gain a +3 bonus to AC against ranged attacks while wearing this armor or wielding this shield."}, {"name": "Reactive Armoring Mk II", "description": "Prerequisite: Armor\n \nThis armor gains the reactive 2 property. If it already has the reactive property, its reactive number increases by 2, to a maximum of 3."}, {"name": "Powered Armoring Mk IV", "description": "Prerequisite: Armor\n \nThis armor gains the powered 17 property. If it already has the powered property, its powered number increases by four steps (from 11 to 19 or 13 to 21)."}, {"name": "Overlay Rangefinder (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to ranged force attacks."}, {"name": "Overlay Amplifier (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to melee force attacks."}, {"name": "Magnetized Shield (Superior)", "description": "Prerequisite: Physical shield\n \nThis shield gains the magnetic 16 property. If it already has the magnetic property, its magnetic number increases by 4, to a maximum of 18."}, {"name": "Interlocking Shielding Mk II", "description": "Prerequiste: Shield\n This shield gains the interlocking 2 property. If it already has the interlocking property, its interlocking number increases by 2, to a maximum of 3."}, {"name": "Insulated Reinforcement (Superior)", "description": "This armor or shield gains the insulated 8 property. If it already has the insulated property, its insulated number increases by 4, to a maximum of 10."}, {"name": "Impermeable Overlay Mk IV", "description": "Prerequisite: Armor\n \nThis armor gains the impermeable 6 property (suits chosen by the GM). If it already has the impermeable property, its impermeable number increases by 6, to a maximum of 9."}, {"name": "Hydraulic Equalizer Mk IV", "description": "This armor or shield’s strength number is reduced by four steps (from 21 to 13 or 19 to 11). If the strength number is 17 or lower, this modification removes the strength property from it entirely."}, {"name": "Fadecasting Underlay Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Overlay (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Charging Reinforcement Mk II", "description": "This armor or shield gains the charging 2 property. If it already has the charging property, its charging number increases by 2, to a maximum of 3."}, {"name": "Bonded Plates Mk IV", "description": "You gain a +3 bonus to AC against melee attacks while wearing this armor or wielding this shield."}, {"name": "Bioenhancement Matrix Mk II", "description": "Your hit point maximum increases by an amount equal to twice your level, and it increases by 2 every time you gain a level."}, {"name": "Barbed Armoring Mk II", "description": "Prerequisite: Armor\n \nThis armor gains the barbed (1d6) property. If it already has the barbed property, the barbed damage increases by two steps (from d4 to d8)."}, {"name": "Avoidant Reinforcement Mk II", "description": "This armor or shield gains the avoidant 2 property. If it already has the avoidant property, its avoidant number increases by 2, to a maximum of 3."}, {"name": "Agile Armoring Mk IV", "description": "Prerequisite: Armor\n \nThis armor gains the agile 17 property. If it already has the agile property, its agile number increases by four steps (from 11 to 19 or 13 to 21)."}, {"name": "Absorptive Reinforcement Mk II", "description": "This armor or shield gains the absorptive 2 property. If it already has the absorptive property, its absorptive number increases by 2, to a maximum of 3."}
                ],
                "Augment": [
                    {"name": "Wisdom Augment (Superior)", "description": "Your Wisdom score increases by 1, and your maximum for this score increases by 1."}, {"name": "Strength Augment (Superior)", "description": "Your Strength score increases by 1, and your maximum for this score increases by 1."}, {"name": "Intelligence Augment (Superior)", "description": "Your Intelligence score increases by 1, and your maximum for this score increases by 1."}, {"name": "Dexterity Augment (Superior)", "description": "Your Dexterity score increases by 1, and your maximum for this score increases by 1."}, {"name": "Constitution Augment (Superior)", "description": "Your Constitution score increases by 1, and your maximum for this score increases by 1."}, {"name": "Charisma Augment (Superior)", "description": "Your Charisma score increases by 1, and your maximum for this score increases by 1."}
                ],
                "Blaster": [
                    {"name": "Withercasting Core (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Vicious Mastery Core", "description": "This weapon gains the vicious 2 property. If it already has the vicious property, its vicious number increases by 2, to a maximum of 3."}, {"name": "Targeting Rangefinder (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to ranged tech attacks."}, {"name": "Targeting Amplifier (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to melee tech attacks."}, {"name": "Smart Interface (Superior)", "description": "This weapon gains the smart (18, +4) property. If it already has the smart property, its smart numbers increase by +4 and +3, respectively, to a maximum of 20 and +6."}, {"name": "Rendcasting Core (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Recoil Dampener (Superior)", "description": "This weapon’s strength number is reduced by four steps (from 21 to 13 or 19 to 11). If the strength number is 17 or lower, this modification removes the strength property from it entirely."}, {"name": "Rapid Core (Superior)", "description": "Prerequisite: Blaster that uses cells or cartridges\n \nThis weapon gains the rapid property, with a rapid number equal to one-fourth its reload number (rounded up), to a minimum of 2. If it already has the rapid property, the rapid number is reduced to one-eighth its reload number (rounded up), to a minimum of 2."}, {"name": "Quantum Splitter Mk II", "description": "When you deal damage with this weapon, you can roll a d6 and add the result to the total."}, {"name": "Precision Chamber Mk IV", "description": "This weapon’s range increases by 40/160."}, {"name": "Piercing Core (Deadly)", "description": "This weapon gains the piercing 2 property. If it already has the piercing property, its piercing number increases by 2, to a maximum of 3."}, {"name": "Ostrine Splitter Mk I", "description": "When you deal damage with this weapon, you deal an additional 1d4 acid, cold, fire, lightning, poison, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Keen Core (Deadly)", "description": "This weapon gains the keen 2 property. If it already has the keen property, its keen number increases by 2, to a maximum of 3."}, {"name": "Fadecasting Core (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Expanded Magazine (Superior)", "description": "Once on each of your turns, you can reload this weapon once without using an action. You can use this feature four times. You regain all expended uses when you reload the weapon with an action."}, {"name": "Disintegration Core Mk IV", "description": "This weapon gains the disintegrate 16 property. If it already has the disintegrate property, its disintegrate number increases by 4, to a maximum of 18."}, {"name": "Dire Mastery Scope", "description": "This weapon gains the dire 2 property. If it already has the dire property, its dire number increases by 2, to a maximum of 3."}, {"name": "Czerka Attenuating Pulsator", "description": "Prerequisite: The ability to cast tech powers\n \nWhen you score a critical hit or reduce a creature to 0 hit points with a ranged attack using this weapon, you can regain a number of tech points equal to your Intelligence modifier (a minimum of one, no action required). Once you’ve used this feature, you must complete a short or long rest before you can use it again."}, {"name": "Compensating Attachment", "description": "This weapon loses the two-handed property."}, {"name": "Burst Core (Superior)", "description": "Prerequisite: Blaster that uses cells or cartridges\n \nThis weapon gains the burst property, with a burst number equal to one-half its reload number (rounded up), to a minimum of 2. If it already has the burst property, the burst number is reduced to one-fourth its reload number (rounded up), to a minimum of 2."}, {"name": "Brutal Scope (Deadly)", "description": "This weapon gains the brutal 2 property. If it already has the brutal property, its brutal number increases by 2, to a maximum of 3."}, {"name": "Amplifying Barrel (Superior)", "description": "You gain a +3 bonus to damage rolls made with this weapon."}, {"name": "Accuracy Focus Mk IV", "description": "You gain a +3 bonus to attack rolls made with this weapon."}
                ],
                "Clothing": [
                    {"name": "Withercasting Stitching Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Inlay (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Wisdom Weave (Superior)", "description": "Your level of proficiency in Wisdom saving throws increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Threatening Pattern (Choice)", "description": "Your level of proficiency in Intimidation increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Techie's Pattern (Choice)", "description": "Your level of proficiency in Technology increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Survivalist's Pattern (Choice)", "description": "Your level of proficiency in Survival increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Stitching Rangefinder Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to ranged tech attacks."}, {"name": "Stitching Amplifier Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to melee tech attacks."}, {"name": "Stealthy Pattern (Choice)", "description": "Your level of proficiency in Stealth increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Silver-Tongued Pattern (Choice)", "description": "Your level of proficiency in Deception increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Rendcasting Stitching Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Inlay (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Reinforced Stitching (Superior)", "description": "You gain a +3 bonus to AC against ranged attacks while wearing this clothing."}, {"name": "Reactive Stitching (Excellent)", "description": "This clothing gains the reactive 2 armor property. If it already has the reactive armor property, its reactive number increases by 2, to a maximum of 3."}, {"name": "Quick-Fingered Pattern (Choice)", "description": "Your level of proficiency in Sleight of Hand increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Performer's Pattern (Choice)", "description": "Your level of proficiency in Performance increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Perceptive Pattern (Choice)", "description": "Your level of proficiency in Perception increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Naturalist's Pattern (Choice)", "description": "Your level of proficiency in Nature increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Medic's Pattern (Choice)", "description": "Your level of proficiency in Medicine increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Loremaster's Pattern (Choice)", "description": "Your level of proficiency in Lore increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Investigator's Pattern (Choice)", "description": "Your level of proficiency in Investigation increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Insulated Pattern (Superior)", "description": "This clothing gains the insulated 8 armor property. If it already has the insulated armor property, its insulated number increases by 4, to a maximum of 3."}, {"name": "Inlay Rangefinder (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to ranged force attacks."}, {"name": "Inlay Amplifier (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to melee force attacks."}, {"name": "Impermeable Inlay (Superior)", "description": "This clothing gains the impermeable 6 armor property (suits chosen by the GM). If it already has the impermeable armor property, its impermeable number increases by 6, to a maximum of 9."}, {"name": "Fadecasting Stitching Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Inlay (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Empathic Pattern (Choice)", "description": "Your level of proficiency in Insight increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Dexterity Weave (Superior)", "description": "Your level of proficiency in Dexterity saving throws increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Constitution Weave (Superior)", "description": "Your level of proficiency in Constitution saving throws increases by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery)."}, {"name": "Clandestine Stitching (Superior)", "description": "This article of clothing come with four hidden pockets, each of which can store up to 1 lb. Finding these hidden pockets requires a DC 24 Investigation check."}, {"name": "Charmer's Pattern (Choice)", "description": "Your level of proficiency in Persuasion increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Brawny Pattern (Choice)", "description": "Your level of proficiency in Athletics increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Bonded Weave (Choice)", "description": "You gain a +3 bonus to AC against melee attacks while wearing this clothing."}, {"name": "Avoidant Weave (Choice)", "description": "This clothing gains the avoidant 2 armor property. If it already has the avoidant armor property, its avoidant number increases by 2, to a maximum of 3."}, {"name": "Animal Handler's Pattern (Choice)", "description": "Your level of proficiency in Animal Handling increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Acrobat's Pattern (Choice)", "description": "Your level of proficiency in Acrobatics increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}, {"name": "Ace Pilot's Pattern (Choice)", "description": "Your level of proficiency in Piloting increases by four steps (to mastery, from trained to high mastery, or from proficient to grand mastery)."}
                ],
                "Focus Generator": [
                    {"name": "Withering Channel (Mastery)", "description": "This item gains the withering 2 property. If it already has the withering property, its withering number increases by 2, to a maximum of 3."}, {"name": "Withercasting Channel (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Storing Emitter (Superior)", "description": "This item gains the storing 4 property. If it already has the storing property, its storing number increases by 4, to a maximum of 6."}, {"name": "Repelling Cycler (Regular)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater. Additionally, creatures always have disadvantage on ability checks to dispel or interrupt your powers."}, {"name": "Rending Conductor (Mastery)", "description": "This item gains the rending 2 property. If it already has the rending property, its rending number increases by 2, to a maximum of 3."}, {"name": "Rendcasting Channel (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Ranging Emitter (Mastery)", "description": "This item gains the ranging 2 property. If it already has the ranging property, its ranging number increases by 2, to a maximum of 3."}, {"name": "Phobium Echoer (Superior)", "description": "When you cast a force power that affects an area in a radius or a cube, you can increase the radius or length of the cube by 10 feet."}, {"name": "Mitigating Channel (Adept)", "description": "This item gains the mitigating 4 property. If it already has the mitigating property, its mitigating number increases by 4, to a maximum of 6."}, {"name": "Inflating Conductor (Regular)", "description": "This item gains the inflating 20 property. If it already has the inflating property, its inflating number increases by 20, to a maximum of 30."}, {"name": "Increasing Cycler (Adept)", "description": "This item gains the increasing 40 property. If it already has the increasing property, its increasing number increases by 40, to a maximum of 60."}, {"name": "Forged Ferricite Mastery Channel", "description": "When you cast a force power of 1st-level or higher that deals damage, you can increase the damage by one and a half times (rounded down) the number of force points spent."}, {"name": "Fading Cycler (Mastery)", "description": "This item gains the fading 2 property. If it already has the fading property, its fading number increases by 2, to a maximum of 3."}, {"name": "Fadecasting Channel (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Extending Cycler (Superior)", "description": "This item gains the extending 20 property. If it already has the extending property, its extending number increases by 20, to a maximum of 30."}, {"name": "Expanding Conductor (Superior)", "description": "This item gains the expanding 20 property. If it already has the expanding property, its expanding number increases by 20, to a maximum of 30."}, {"name": "Enlarging Channel (Regular)", "description": "This item gains the enlarging 20 property. If it already has the enlarging property, its enlarging number increases by 20, to a maximum of 30."}, {"name": "Elongating Emitter (Adept)", "description": "This item gains the elongating 20 property. If it already has the elongating property, its elongating number increases by 20, to a maximum of 30."}, {"name": "Dispelling Emitter (Superior)", "description": "This item gains the dispelling 4 property. If it already has the dispelling property, its dispelling number increases by 4, to a maximum of 6."}, {"name": "Constitution Emitter (Superior)", "description": "This item’s constitution number is reduced by four steps (from 21 to 13 or 19 to 11). If the constitution number is 17 or lower, this modification removes the constitution property from it entirely."}, {"name": "Channeling Rangefinder (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to ranged force attacks."}, {"name": "Channeling Amplifier (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to melee force attacks."}, {"name": "Bolstering Channel (Adept)", "description": "This item gains the bolstering 8 property. If it already has the bolstering property, its bolstering number increases by 8, to a maximum of 12."}, {"name": "Amplifying Channel (Mastery)", "description": "This item gains the amplifying 2 property. If it already has the amplifying property, its amplifying number increases by 2, to a maximum of 3."}, {"name": "Accessing Cycler (Regular)", "description": "This item gains the accessing 4 property. If it already has the accessing property, its accessing number increases by 4, to a maximum of 6."}, {"name": "Absorbing Conductor (Adept)", "description": "This item gains the absorbing 8 property. If it already has the absorbing property, its absorbing number increases by 8, to a maximum of 12."}
                ],
                "Lightweapon": [
                    {"name": "Telgorn Jolt Stabilizer (Improved)", "description": "When you cast a force power or use a class feature that requires a melee weapon attack, you can spend 1 force point to change the weapon’s damage type to lightning and deal an additional 1d8 lightning damage."}, {"name": "Ostrine Crystal (Regular)", "description": "When you deal damage with this weapon, you deal an additional 1d4 force, lightning, necrotic, poison, psychic, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Krayt Dragon Pearl (Regular)", "description": "You gain a +1 bonus to damage rolls made with this weapon. Additionally, you gain a +1 bonus to damage rolls you make with force powers when using this weapon as your focus. If the power would damage multiple targets, you can only apply this damage bonus to one of them."}, {"name": "Byrothsis Adept Cell", "description": "When this weapon is levitated by the Force to deal damage through a class feature or force power you use, it deals additional damage equal to one of its weapon damage dice."}, {"name": "Withercasting Crystal (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Vicious Mastery Hilt", "description": "This weapon gains the vicious 2 property. If it already has the vicious property, its vicious number increases by 2, to a maximum of 3."}, {"name": "Versatile Handle (Superior)", "description": "Prerequisite: Lacks double or two-handed property\n \nThis weapon gains the versatile (1d12) property. If it already has the versatile property, the versatile damage increases by two steps (from 2d4 to d12, d10 to 2d6, from d12 to 3d4, or from 2d6 to 3d4)."}, {"name": "Throwing Weapon Hilt (Superior)", "description": "This weapon gains thrown (40/120) property. If it already has the thrown property, the range increases by 20/60."}, {"name": "Stabilizer Mastery Cell", "description": "This weapon’s dexterity number is reduced by four steps (from 21 to 13 or 19 to 11). If the dexterity number is 17 or lower, this modification removes the dexterity property from it entirely."}, {"name": "Rendcasting Crystal (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Piercing Cell (Deadly)", "description": "This weapon gains the piercing 2 property. If it already has the piercing property, its piercing number increases by 2, to a maximum of 3."}, {"name": "Ossus Mastery Lens", "description": "You gain a +3 bonus to attack rolls made with this weapon."}, {"name": "Lightweight Stabilizer Frame", "description": "Prerequisite: Two-handed property\n \nThis weapon loses the two-handed property."}, {"name": "Keen Beam (Deadly)", "description": "This weapon gains the keen 2 property. If it already has the keen property, its keen number increases by 2, to a maximum of 3."}, {"name": "Fadecasting Crystal (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Extended Beam", "description": "This weapon gains the reach property."}, {"name": "Double Hilt", "description": "Prerequisite: Lacks two-handed or versatile property\n \nThis weapon gains the double property, with a double damage value equal to its normal damage."}, {"name": "Dire Mastery Hilt", "description": "This weapon gains the dire 2 property. If it already has the dire property, its dire number increases by 2, to a maximum of 3."}, {"name": "Damind Crystal (Regular)", "description": "When you deal damage with this weapon, you can roll a d6 and add the result to the total."}, {"name": "Crystalizing Rangefinder (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to ranged force attacks."}, {"name": "Crystalizing Amplifier (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to melee force attacks."}, {"name": "Crossguard Hilt (Superior)", "description": "This weapon gains the defensive 2 property. If it already has the defensive property, its defensive number increases by 2, to a maximum of 3."}, {"name": "Corruption Crystal (Adept)", "description": "This weapon gains the corruption 16 property. If it already has the corruption property, its corruption number increases by 4, to a maximum of 18."}, {"name": "Brutal Cell (Deadly)", "description": "This weapon gains the brutal 2 property. If it already has the brutal property, its brutal number increases by 2, to a maximum of 3."}, {"name": "Bright Crystal (Adept)", "description": "This weapon gains the bright 16 property. If it already has the bright property, its bright number increases by 4, to a maximum of 18."}, {"name": "Biting Crystal (Adept)", "description": "This weapon gains the biting 16 property. If it already has the biting property, its biting number increases by 4, to a maximum of 18."}, {"name": "Adegan Crystal (Regular)", "description": "You gain a +3 bonus to damage rolls made with this weapon."}
                ],
                "Vibroweapon": [
                    {"name": "Withercasting Oscillator Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Withercasting Guard (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Vicious Mastery Guard", "description": "This weapon gains the vicious 2 property. If it already has the vicious property, its vicious number increases by 2, to a maximum of 3."}, {"name": "Versatile Frame (Superior)", "description": "Prerequisite: Lacks double or two-handed property\n \nThis weapon gains the versatile (1d12) property. If it already has the versatile property, the versatile damage increases by two steps (from 2d4 to d12, d10 to 2d6, from d12 to 3d4, or from 2d6 to 3d4)."}, {"name": "Throwing Weapon Guard (Superior)", "description": "This weapon gains thrown (40/120) property. If it already has the thrown property, the range increases by 20/60."}, {"name": "Sonorous Oscillator Mk IV", "description": "This weapon gains the sonorous 16 property. If it already has the sonorous property, its sonorous number increases by 4, to a maximum of 18."}, {"name": "Shocking Oscillator Mk IV", "description": "This weapon gains the shocking 16 property. If it already has the shocking property, its shocking number increases by 4, to a maximum of 18."}, {"name": "Serrated Edge Mk II", "description": "When you deal damage with this weapon, you can roll a d6 and add the result to the total."}, {"name": "Rendcasting Oscillator Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Rendcasting Guard (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "RZ-3 Extender Frame", "description": "This weapon gains the reach property."}, {"name": "Piercing Oscillator (Deadly)", "description": "This weapon gains the piercing 2 property. If it already has the piercing property, its piercing number increases by 2, to a maximum of 3."}, {"name": "Ostrine Edge (Deadly)", "description": "When you deal damage with this weapon, you deal an additional 1d4 acid, cold, fire, lightning, poison, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Oscillating Rangefinder Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to ranged tech attacks."}, {"name": "Oscillating Amplifier Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to melee tech attacks."}, {"name": "Neutronium Edge (Deadly)", "description": "You gain a +3 bonus to damage rolls made with this weapon."}, {"name": "Neuralizing Oscillator Mk IV", "description": "This weapon gains the neuralizing 16 property. If it already has the neuralizing property, its neuralizing number increases by 4, to a maximum of 18."}, {"name": "Monomolecular Oscillator Mk II", "description": "This weapon ignores resistance to kinetic damage, and treats immunity as resistance."}, {"name": "Keen Oscillator (Deadly)", "description": "This weapon gains the keen 2 property. If it already has the keen property, its keen number increases by 2, to a maximum of 3."}, {"name": "Guard Rangefinder (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to ranged force attacks."}, {"name": "Guard Amplifier (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to melee force attacks."}, {"name": "Fiber-Alloy Guard", "description": "Prerequisite: Two-handed property\n \nThis weapon loses the two-handed property."}, {"name": "Fadecasting Oscillator Mk IV", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Fadecasting Guard (Adept)", "description": "While using this item as your focus, you gain a +3 bonus to the force save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Double Guard", "description": "Prerequisite: Lacks two-handed or versatile property\n \nThis weapon gains the double property, with a double damage value equal to its normal damage."}, {"name": "Dire Mastery Guard", "description": "This weapon gains the dire 2 property. If it already has the dire property, its dire number increases by 2, to a maximum of 3."}, {"name": "Defensive Guard (Superior)", "description": "This weapon gains the defensive 2 property. If it already has the defensive property, its defensive number increases by 2, to a maximum of 3."}, {"name": "Contoured Grip (Superior)", "description": "You gain a +3 bonus to attack rolls made with this weapon."}, {"name": "Compensation Oscillator (Superior)", "description": "This weapon’s dexterity number is reduced by four steps (from 21 to 13 or 19 to 11). If the dexterity number is 17 or lower, this modification removes the dexterity property from it entirely."}, {"name": "Brutal Oscillator (Deadly)", "description": "This weapon gains the brutal 2 property. If it already has the brutal property, its brutal number increases by 2, to a maximum of 3."}
                ],
                "Wristpad": [
                    {"name": "Withering Processor (Mastery)", "description": "This item gains the withering 2 property. If it already has the withering property, its withering number increases by 2, to a maximum of 3."}, {"name": "Withercasting Processor (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Wisdom or Charisma saving throw."}, {"name": "Surging Processor Mk IV", "description": "This item gains the surging 4 property. If it already has the surging property, its surging number increases by 4, to a maximum of 6."}, {"name": "Storing Dataport (Superior)", "description": "This item gains the storing 4 property. If it already has the storing property, its storing number increases by 4, to a maximum of 6."}, {"name": "Repelling Motherboard (Excellent)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater. Additionally, creatures always have disadvantage on ability checks to dispel or interrupt your powers."}, {"name": "Rending Amplifier (Mastery)", "description": "This item gains the rending 2 property. If it already has the rending property, its rending number increases by 2, to a maximum of 3."}, {"name": "Rendcasting Processor (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Dexterity or Intelligence saving throw."}, {"name": "Ranging Dataport (Mastery)", "description": "This item gains the ranging 2 property. If it already has the ranging property, its ranging number increases by 2, to a maximum of 3."}, {"name": "Processing Rangefinder (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to ranged tech attacks."}, {"name": "Processing Amplifier (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to melee tech attacks."}, {"name": "Mitigating Processor Mk IV", "description": "This item gains the mitigating 4 property. If it already has the mitigating property, its mitigating number increases by 4, to a maximum of 6."}, {"name": "Inflating Amplifier (Excellent)", "description": "This item gains the inflating 20 property. If it already has the inflating property, its inflating number increases by 20, to a maximum of 30."}, {"name": "Increasing Motherboard Mk IV", "description": "This item gains the increasing 40 property. If it already has the increasing property, its increasing number increases by 40, to a maximum of 60."}, {"name": "Fading Motherboard (Mastery)", "description": "This item gains the fading 2 property. If it already has the fading property, its fading number increases by 2, to a maximum of 3."}, {"name": "Fadecasting Processor (Mastery)", "description": "While using this item as your focus, you gain a +3 bonus to the tech save DC of powers that require a Strength or Constitution saving throw."}, {"name": "Extending Motherboard (Superior)", "description": "This item gains the extending 20 property. If it already has the extending property, its extending number increases by 20, to a maximum of 30."}, {"name": "Expanding Amplifier (Superior)", "description": "This item gains the expanding 20 property. If it already has the expanding property, its expanding number increases by 20, to a maximum of 30."}, {"name": "Enlarging Processor (Excellent)", "description": "This item gains the enlarging 20 property. If it already has the enlarging property, its enlarging number increases by 20, to a maximum of 30."}, {"name": "Elongating Dataport Mk IV", "description": "This item gains the elongating 20 property. If it already has the elongating property, its elongating number increases by 20, to a maximum of 30."}, {"name": "Dispelling Dataport (Superior)", "description": "This item gains the dispelling 4 property. If it already has the dispelling property, its dispelling number increases by 4, to a maximum of 6."}, {"name": "Constitution Dataport (Superior)", "description": "This item’s constitution number is reduced by four steps (from 21 to 13 or 19 to 11). If the constitution number is 17 or lower, this modification removes the constitution property from it entirely."}, {"name": "Amplifying Processor (Mastery)", "description": "This item gains the amplifying 2 property. If it already has the amplifying property, its amplifying number increases by 2, to a maximum of 3."}, {"name": "Accessing Motherboard (Excellent)", "description": "This item gains the accessing 4 property. If it already has the accessing property, its accessing number increases by 4, to a maximum of 6."}, {"name": "Absorbing Amplifier Mk IV", "description": "This item gains the absorbing 8 property. If it already has the absorbing property, its absorbing number increases by 8, to a maximum of 12."}
                ]
            }
        },
        {
            "description": "Legendary",
            "valueModifier": 5000,
            "slots": 6,
            "installationRemovalDC": "26",
            "modList": {
                "Armor": [
                    {"name": "Powered Armoring Mk V", "description": "Prerequisite: Armor\n \nThis armor gains the powered 19 property. If it already has the powered property, its powered number increases by five steps (from 11 to 21)."}, {"name": "Magnetized Shield (Exceptional)", "description": "Prerequisite: Physical shield\n \nThis shield gains the magnetic 17 property. If it already has the magnetic property, its magnetic number increases by 5, to a maximum of 18."}, {"name": "Insulated Reinforcement (Exceptional)", "description": "This armor or shield gains the insulated 9 property. If it already has the insulated property, its insulated number increases by 5, to a maximum of 10."}, {"name": "Impermeable Overlay Mk V", "description": "Prerequisite: Armor\n \nThis armor gains the impermeable 8 property (suits chosen by the GM). If it already has the impermeable property, its impermeable number increases by 8, to a maximum of 9."}, {"name": "Hydraulic Equalizer Mk V", "description": "This armor or shield’s strength number is reduced by five steps (from 21 to 11). If the strength number is 19 or lower, this modification removes the strength property from it entirely."}, {"name": "Gauntlet Armoring Mk III", "description": "Prerequisite: Armor\n \nThis armor gains the gauntleted (1d8) property. If it already has the gauntleted property, the gauntleted damage increases to d8."}, {"name": "Cortosis Weave (Exceptional)", "description": "This armor or shield gains the absorptive 2 property. If it already has the absorptive property, its absorptive property increases by 2, to a maximum of 3. Additionally, when taking energy damage from a lightweapon, this armor or shield’s absorptive number is doubled, to a maximum of 6."}, {"name": "Ballistic Polymer (Exceptional)", "description": "While you have temporary hit points, kinetic and energy damage you take is reduced by an amount equal to your proficiency bonus."}, {"name": "Agile Armoring Mk V", "description": "Prerequisite: Armor\n \nThis armor gains the agile 19 property. If it already has the agile property, its agile number increases by five steps (from 11 to 21)."}
                ],
                "Augment": [
                    {"name": "Wisdom Augment (Exceptional)", "description": "Your Wisdom score increases by 2, and your maximum for this score increases by 1."}, {"name": "Strength Augment (Exceptional)", "description": "Your Strength score increases by 2, and your maximum for this score increases by 1."}, {"name": "Intelligence Augment (Exceptional)", "description": "Your Intelligence score increases by 2, and your maximum for this score increases by 1."}, {"name": "Dexterity Augment (Exceptional)", "description": "Your Dexterity score increases by 2, and your maximum for this score increases by 1."}, {"name": "Constitution Augment (Exceptional)", "description": "Your Constitution score increases by 2, and your maximum for this score increases by 1."}, {"name": "Charisma Augment (Exceptional)", "description": "Your Charisma score increases by 2, and your maximum for this score increases by 1."}
                ],
                "Blaster": [
                    {"name": "Smart Interface (Exceptional)", "description": "This weapon gains the smart (19, +5) property. If it already has the smart property, its smart numbers increase by +5 and +4, respectively, to a maximum of 20 and +6."}, {"name": "Recoil Dampener (Exceptional)", "description": "This weapon’s strength number is reduced by five steps (from 21 to 11). If the strength number is 19 or lower, this modification removes the strength property from it entirely."}, {"name": "Quantum Splitter Mk III", "description": "When you deal damage with this weapon, you can roll a d8 and add the result to the total."}, {"name": "Precision Chamber Mk V", "description": "This weapon’s range increases by 50/200."}, {"name": "Ostrine Splitter Mk II", "description": "When you deal damage with this weapon, you deal an additional 1d6 acid, cold, fire, lightning, poison, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Expanded Magazine (Exceptional)", "description": "Once on each of your turns, you can reload this weapon once without using an action. You can use this feature five times. You regain all expended uses when you reload the weapon with an action."}, {"name": "Disintegration Core Mk V", "description": "This weapon gains the disintegrate 17 property. If it already has the disintegrate property, its disintegrate number increases by 5, to a maximum of 18."}, {"name": "Aratech Recycler Core Mk II", "description": "Prerequisite: Burst property\n \nWhen you use the burst feature of this weapon, you can choose to include up to 2 additional creatures within 5 feet of any affected space to also be affected the burst, if they were not already.\n Once per turn, when you deal damage with this weapon, your walking speed increases by 10 feet until the start of your next turn, and the damaged creature can’t make opportunity attacks against you for the rest of your turn."}
                ],
                "Clothing": [
                    {"name": "Threatening Pattern (Elite)", "description": "Your level of proficiency in Intimidation increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Techie's Pattern (Elite)", "description": "Your level of proficiency in Technology increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Survivalist's Pattern (Elite)", "description": "Your level of proficiency in Survival increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Strength Weave (Exceptional)", "description": "Your level of proficiency in Strength saving throws increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Stealthy Pattern (Elite)", "description": "Your level of proficiency in Stealth increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Silver-Tongued Pattern (Elite)", "description": "Your level of proficiency in Deception increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Quick-Fingered Pattern (Elite)", "description": "Your level of proficiency in Sleight of Hand increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Performer's Pattern (Elite)", "description": "Your level of proficiency in Performance increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Perceptive Pattern (Elite)", "description": "Your level of proficiency in Perception increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Naturalist's Pattern (Elite)", "description": "Your level of proficiency in Nature increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Medic's Pattern (Elite)", "description": "Your level of proficiency in Medicine increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Loremaster's Pattern (Elite)", "description": "Your level of proficiency in Lore increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Investigator's Pattern (Elite)", "description": "Your level of proficiency in Investigation increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Intelligence Weave (Exceptional)", "description": "Your level of proficiency in Intelligence saving throws increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Insulated Pattern (Exceptional)", "description": "This clothing gains the insulated 9 armor property. If it already has the insulated armor property, its insulated number increases by 5, to a maximum of 10."}, {"name": "Impermeable Inlay (Exceptional)", "description": "This clothing gains the impermeable 8 armor property (suits chosen by the GM). If it already has the impermeable armor property, its impermeable number increases by 8, to a maximum of 9."}, {"name": "Empathic Pattern (Elite)", "description": "Your level of proficiency in Insight increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Clandestine Stitching (Exceptional)", "description": "This article of clothing come with five hidden pockets, each of which can store up to 1 lb. Finding these hidden pockets requires a DC 27 Investigation check."}, {"name": "Charmer's Pattern (Elite)", "description": "Your level of proficiency in Persuasion increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Charisma Weave (Exceptional)", "description": "Your level of proficiency in Charisma saving throws increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Brawny Pattern (Elite)", "description": "Your level of proficiency in Athletics increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Animal Handler's Pattern (Elite)", "description": "Your level of proficiency in Animal Handling increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Acrobat's Pattern (Elite)", "description": "Your level of proficiency in Acrobatics increases by five steps (to high mastery or from trained to grand mastery)."}, {"name": "Ace Pilot's Pattern (Elite)", "description": "Your level of proficiency in Piloting increases by five steps (to high mastery or from trained to grand mastery)."}
                ],
                "Focus Generator": [
                    {"name": "Storing Emitter (Exceptional)", "description": "This item gains the storing 5 property. If it already has the storing property, its storing number increases by 5, to a maximum of 6."}, {"name": "Repelling Cycler (Flawless)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater. Additionally, creatures always have disadvantage on ability checks to dispel or interrupt your powers, and when a creatures make an ability check to dispel or interrupt your powers with disadvantage, they must reroll one of the dice once (your choice)."}, {"name": "Mitigating Channel (Master)", "description": "This item gains the mitigating 5 property. If it already has the mitigating property, its mitigating number increases by 5, to a maximum of 6."}, {"name": "Inflating Conductor (Flawless)", "description": "This item gains the inflating 25 property. If it already has the inflating property, its inflating number increases by 25, to a maximum of 30."}, {"name": "Increasing Cycler (Master)", "description": "This item gains the increasing 50 property. If it already has the increasing property, its increasing number increases by 50, to a maximum of 60."}, {"name": "Forged Ferricite Supremacy Channel", "description": "When you cast a force power of 1st-level or higher that deals damage, you can increase the damage by twice the number of force points spent."}, {"name": "Extending Cycler (Exceptional)", "description": "This item gains the extending 25 property. If it already has the extending property, its extending number increases by 25, to a maximum of 30."}, {"name": "Expanding Conductor (Exceptional)", "description": "This item gains the expanding 25 property. If it already has the expanding property, its expanding number increases by 25, to a maximum of 30."}, {"name": "Enlarging Channel (Flawless)", "description": "This item gains the enlarging 25 property. If it already has the enlarging property, its enlarging number increases by 25, to a maximum of 30."}, {"name": "Elongating Emitter (Master)", "description": "This item gains the elongating 25 property. If it already has the elongating property, its elongating number increases by 25, to a maximum of 30."}, {"name": "Dispelling Emitter (Exceptional)", "description": "This item gains the dispelling 5 property. If it already has the dispelling property, its dispelling number increases by 5, to a maximum of 6."}, {"name": "Constitution Emitter (Exceptional)", "description": "This item’s constitution number is reduced by five steps (from 21 to 11). If the constitution number is 19 or lower, this modification removes the constitution property from it entirely."}, {"name": "Bolstering Channel (Master)", "description": "This item gains the bolstering 10 property. If it already has the bolstering property, its bolstering number increases by 10, to a maximum of 12."}, {"name": "Accessing Cycler (Flawless)", "description": "This item gains the accessing 5 property. If it already has the accessing property, its accessing number increases by 5, to a maximum of 6."}, {"name": "Absorbing Conductor (Master)", "description": "This item gains the absorbing 10 property. If it already has the absorbing property, its absorbing number increases by 10, to a maximum of 12."}
                ],
                "Lightweapon": [
                    {"name": "Ostrine Crystal (Flawless)", "description": "When you deal damage with this weapon, you deal an additional 1d6 force, lightning, necrotic, poison, psychic, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Krayt Dragon Pearl (Flawless)", "description": "You gain a +2 bonus to damage rolls made with this weapon. Additionally, you gain a +2 bonus to damage rolls you make with force powers when using this weapon as your focus. If the power would damage multiple targets, you can only apply this damage bonus to one of them."}, {"name": "Ghostfire Crystal", "description": "This weapon loses the luminous property, if it has it. Additionally, you gain a +2 bonus to damage rolls made with this weapon, when you attack a creature with it, the creature can’t take reactions until the end of the current turn.\n These crystals are so transparent that they are nigh invisible. The blade formed by this form of kyber makes no noise, is dim and may form illusory images as it is used."}, {"name": "Throwing Weapon Hilt (Exceptional)", "description": "This weapon gains thrown (50/150) property. If it already has the thrown property, the range increases by 25/75."}, {"name": "Stabilizer Supremacy Cell", "description": "This weapon’s dexterity number is reduced by five steps (from 21 to 11). If the dexterity number is 19 or lower, this modification removes the dexterity property from it entirely."}, {"name": "Damind Crystal (Flawless)", "description": "When you deal damage with this weapon, you can roll a d8 and add the result to the total."}, {"name": "Corruption Crystal (Master)", "description": "This weapon gains the corruption 17 property. If it already has the corruption property, its corruption number increases by 5, to a maximum of 18."}, {"name": "Bright Crystal (Master)", "description": "This weapon gains the bright 17 property. If it already has the bright property, its bright number increases by 5, to a maximum of 18."}, {"name": "Biting Crystal (Master)", "description": "This weapon gains the biting 17 property. If it already has the biting property, its biting number increases by 5, to a maximum of 18."}
                ],
                "Vibroweapon": [
                    {"name": "Throwing Weapon Guard (Exceptional)", "description": "This weapon gains thrown (50/150) property. If it already has the thrown property, the range increases by 25/75."}, {"name": "Sonorous Oscillator Mk V", "description": "This weapon gains the sonorous 17 property. If it already has the sonorous property, its sonorous number increases by 5, to a maximum of 18."}, {"name": "Shocking Oscillator Mk V", "description": "This weapon gains the shocking 17 property. If it already has the shocking property, its shocking number increases by 5, to a maximum of 18."}, {"name": "Serrated Edge Mk III", "description": "When you deal damage with this weapon, you can roll a d8 and add the result to the total."}, {"name": "Ostrine Edge (Lethal)", "description": "When you deal damage with this weapon, you deal an additional 1d6 acid, cold, fire, lightning, poison, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Neuralizing Oscillator Mk V", "description": "This weapon gains the neuralizing 17 property. If it already has the neuralizing property, its neuralizing number increases by 5, to a maximum of 18."}, {"name": "Nagai Edge (Exceptional)", "description": "When you have advantage on an attack roll you make with this weapon, get the same result on both dice rolls, and hit, you deal three additional weapon dice worth of damage."}, {"name": "Compensation Oscillator (Exceptional)", "description": "This weapon’s dexterity number is reduced by five steps (from 21 to 11). If the dexterity number is 19 or lower, this modification removes the dexterity property from it entirely."}
                ],
                "Wristpad": [
                    {"name": "Surging Processor Mk V", "description": "This item gains the surging 5 property. If it already has the surging property, its surging number increases by 5, to a maximum of 6."}, {"name": "Storing Dataport (Exceptional)", "description": "This item gains the storing 5 property. If it already has the storing property, its storing number increases by 5, to a maximum of 6."}, {"name": "Sienar Starfire X-Force Mk II", "description": "When you spend tech points to cast a tech power that restores hit points to a creature, the creature gains a number of temporary hit points equal to twice the number of tech points spent."}, {"name": "Repelling Motherboard (Outstanding)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater. Additionally, creatures always have disadvantage on ability checks to dispel or interrupt your powers, and when a creatures make an ability check to dispel or interrupt your powers with disadvantage, they must reroll one of the dice once (your choice)."}, {"name": "Mitigating Processor Mk V", "description": "This item gains the mitigating 5 property. If it already has the mitigating property, its mitigating number increases by 5, to a maximum of 6."}, {"name": "Inflating Amplifier (Outstanding)", "description": "This item gains the inflating 25 property. If it already has the inflating property, its inflating number increases by 25, to a maximum of 30."}, {"name": "Increasing Motherboard Mk V", "description": "This item gains the increasing 50 property. If it already has the increasing property, its increasing number increases by 50, to a maximum of 60."}, {"name": "Extending Motherboard (Exceptional)", "description": "This item gains the extending 25 property. If it already has the extending property, its extending number increases by 25, to a maximum of 30."}, {"name": "Expanding Amplifier (Exceptional)", "description": "This item gains the expanding 25 property. If it already has the expanding property, its expanding number increases by 25, to a maximum of 30."}, {"name": "Enlarging Processor (Outstanding)", "description": "This item gains the enlarging 25 property. If it already has the enlarging property, its enlarging number increases by 25, to a maximum of 30."}, {"name": "Elongating Dataport Mk V", "description": "This item gains the elongating 25 property. If it already has the elongating property, its elongating number increases by 25, to a maximum of 30."}, {"name": "Dispelling Dataport (Exceptional)", "description": "This item gains the dispelling 5 property. If it already has the dispelling property, its dispelling number increases by 5, to a maximum of 6."}, {"name": "Czerka Elite Pro Mk V", "description": "When you cast a tech power with this wristpad and at least one creature fails its saving throw to resist its effects, you gain a d12 that you can roll and add to the damage or healing of a tech power you cast. This die lasts for 1 minute, and you can only have one at a time."}, {"name": "Constitution Dataport (Exceptional)", "description": "This item’s constitution number is reduced by five steps (from 21 to 11). If the constitution number is 19 or lower, this modification removes the constitution property from it entirely."}, {"name": "Accessing Motherboard (Outstanding)", "description": "This item gains the accessing 5 property. If it already has the accessing property, its accessing number increases by 5, to a maximum of 6."}, {"name": "Absorbing Amplifier Mk V", "description": "This item gains the absorbing 10 property. If it already has the absorbing property, its absorbing number increases by 10, to a maximum of 12."}
                ]
            }
        },
        {
            "description": "Artifact",
            "valueModifier": 25000,
            "slots": 6,
            "installationRemovalDC": "30",
            "modList": {
                "Armor": [
                    {"name": "Versatile Shielding Mk III", "description": "Prerequiste: Shield\n This shield gains the versatile 3 property. If it already has the versatile property, its versatile number increases to 3."}, {"name": "Spiked Shielding Mk III", "description": "Prerequiste: Shield\n This shield gains the spiked (1d8) property. If it already has the spiked property, the spiked damage increases to d8."}, {"name": "Responsive Shielding Mk III", "description": "Prerequiste: Shield\n This shield gains the responsive 3 property. If it already has the responsive property, its responsive number increases to 3."}, {"name": "Reactive Armoring Mk III", "description": "Prerequisite: Armor\n \nThis armor gains the reactive 3 property. If it already has the reactive property, its reactive number increases to 3."}, {"name": "Powered Armoring Mk VI", "description": "Prerequisite: Armor\n \nThis armor gains the powered 21 property. If it already has the powered property, its powered number increases to 21."}, {"name": "Magnetized Shield (Champion)", "description": "Prerequisite: Physical shield\n \nThis shield gains the magnetic 18 property. If it already has the magnetic property, its magnetic number increases to 18."}, {"name": "Interlocking Shielding Mk III", "description": "Prerequiste: Shield\n This shield gains the interlocking 3 property. If it already has the interlocking property, its interlocking number increases to 3."}, {"name": "Insulated Reinforcement (Champion)", "description": "This armor or shield gains the insulated 10 property. If it already has the insulated property, its insulated number increases to 10."}, {"name": "Impermeable Overlay Mk VI", "description": "Prerequisite: Armor\n \nThis armor gains the impermeable 9 property (suits chosen by the GM). If it already has the impermeable property, its impermeable number increases to 9."}, {"name": "Hydraulic Equalizer Mk VI", "description": "This armor or shield loses the strength property."}, {"name": "Charging Reinforcement Mk III", "description": "This armor or shield gains the charging 3 property. If it already has the charging property, its charging number increases to 3."}, {"name": "Bioenhancement Matrix Mk III", "description": "Your hit point maximum increases by an amount equal to three times your level, and it increases by 3 every time you gain a level."}, {"name": "Barbed Armoring Mk III", "description": "Prerequisite: Armor\n \nThis armor gains the barbed (1d8) property. If it already has the barbed property, the barbed damage increases to d8."}, {"name": "Avoidant Reinforcement Mk III", "description": "This armor or shield gains the avoidant 3 property. If it already has the avoidant property, its avoidant number increases to 3."}, {"name": "Agile Armoring Mk VI", "description": "Prerequisite: Armor\n \nThis armor gains the agile 21 property. If it already has the agile property, its agile number increases to 21."}, {"name": "Absorptive Reinforcement Mk III", "description": "This armor or shield gains the absorptive 3 property. If it already has the absorptive property, its absorptive number increases to 3."}
                ],
                "Augment": [
                    {"name": "Wisdom Augment (Champion)", "description": "Your Wisdom score increases by 2, and your maximum for this score increases by 2."}, {"name": "Strength Augment (Champion)", "description": "Your Strength score increases by 2, and your maximum for this score increases by 2."}, {"name": "Intelligence Augment (Champion)", "description": "Your Intelligence score increases by 2, and your maximum for this score increases by 2."}, {"name": "Dexterity Augment (Champion)", "description": "Your Dexterity score increases by 2, and your maximum for this score increases by 2."}, {"name": "Constitution Augment (Champion)", "description": "Your Constitution score increases by 2, and your maximum for this score increases by 2."}, {"name": "Charisma Augment (Champion)", "description": "Your Charisma score increases by 2, and your maximum for this score increases by 2."}
                ],
                "Blaster": [
                    {"name": "Vicious Ascendancy Core", "description": "This weapon gains the vicious 3 property. If it already has the vicious property, its vicious number increases to 3."}, {"name": "Smart Interface (Champion)", "description": "This weapon gains the smart (20, +6) property. If it already has the smart property, its smart numbers increase to 20 and +6, respectively."}, {"name": "Recoil Dampener (Champion)", "description": "This weapon loses the strength property."}, {"name": "Rapid Core (Champion)", "description": "Prerequisite: Blaster that uses cells or cartridges\n \nThis weapon gains the rapid property, with a rapid number equal to one-eighth its reload number (rounded up), to a minimum of 2. If it already has the rapid property, the rapid number is reduced to one-sixteenth its reload number (rounded up), to a minimum of 2."}, {"name": "Quantum Splitter Mk IV", "description": "When you deal damage with this weapon, you can roll a d10 and add the result to the total."}, {"name": "Precision Chamber Mk VI", "description": "This weapon’s range increases by 60/240."}, {"name": "Piercing Core (Devastating)", "description": "This weapon gains the piercing 3 property. If it already has the piercing property, its piercing number increases to 3."}, {"name": "Ostrine Splitter Mk III", "description": "When you deal damage with this weapon, you deal an additional 1d8 acid, cold, fire, lightning, poison, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Multispectral Optics (Champion)", "description": "While looking through this weapon’s scope, you have truesight out to a distance equal to the long range of this weapon and you can see creatures that are lightly or heavily obscured. Additionally, you gain a +2 bonus to attack rolls."}, {"name": "Keen Core (Devastating)", "description": "This weapon gains the keen 3 property. If it already has the keen property, its keen number increases to 3."}, {"name": "Expanded Magazine (Champion)", "description": "Once on each of your turns, you can reload this weapon once without using an action. You can use this feature six times. You regain all expended uses when you reload the weapon with an action."}, {"name": "Disintegration Core Mk VI", "description": "This weapon gains the disintegrate 18 property. If it already has the disintegrate property, its disintegrate number increases to 18."}, {"name": "Dire Ascendancy Scope", "description": "This weapon gains the dire 3 property. If it already has the dire property, its dire number increases to 3."}, {"name": "Burst Core (Champion)", "description": "Prerequisite: Blaster that uses cells or cartridges\n \nThis weapon gains the burst property, with a burst number equal to one-fourth its reload number (rounded up), to a minimum of 2. If it already has the burst property, the burst number is reduced to one-eighth its reload number (rounded up), to a minimum of 2."}, {"name": "Brutal Scope (Devastating)", "description": "This weapon gains the brutal 3 property. If it already has the brutal property, its brutal number increases to 3."}
                ],
                "Clothing": [
                    {"name": "Wisdom Weave (Champion)", "description": "Your level of proficiency in Wisdom saving throws increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Threatening Pattern (Exquisite)", "description": "You gain grand mastery in Intimidation."}, {"name": "Techie's Pattern (Exquisite)", "description": "You gain grand mastery in Technology."}, {"name": "Survivalist's Pattern (Exquisite)", "description": "You gain grand mastery in Survival."}, {"name": "Stealthy Pattern (Exquisite)", "description": "You gain grand mastery in Stealth."}, {"name": "Silver-Tongued Pattern (Exquisite)", "description": "You gain grand mastery in Deception."}, {"name": "Reactive Stitching (Prime)", "description": "This clothing gains the reactive 3 armor property. If it already has the reactive armor property, its reactive number increases to 3."}, {"name": "Quick-Fingered Pattern (Exquisite)", "description": "You gain grand mastery in Sleight of Hand."}, {"name": "Performer's Pattern (Exquisite)", "description": "You gain grand mastery in Performance."}, {"name": "Perceptive Pattern (Exquisite)", "description": "You gain grand mastery in Perception."}, {"name": "Naturalist's Pattern (Exquisite)", "description": "You gain grand mastery in Nature."}, {"name": "Medic's Pattern (Exquisite)", "description": "You gain grand mastery in Medicine."}, {"name": "Loremaster's Pattern (Exquisite)", "description": "You gain grand mastery in Lore."}, {"name": "Investigator's Pattern (Exquisite)", "description": "You gain grand mastery in Investigation."}, {"name": "Insulated Pattern (Champion)", "description": "This clothing gains the insulated 10 armor property. If it already has the insulated armor property, its insulated number increases to 10."}, {"name": "Impermeable Inlay (Champion)", "description": "This clothing gains the impermeable 9 armor property (suits chosen by the GM). If it already has the impermeable armor property, its impermeable number increases to 9."}, {"name": "Empathic Pattern (Exquisite)", "description": "You gain grand mastery in Insight."}, {"name": "Dexterity Weave (Champion)", "description": "Your level of proficiency in Dexterity saving throws increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Constitution Weave (Champion)", "description": "Your level of proficiency in Constitution saving throws increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery)."}, {"name": "Clandestine Stitching (Champion)", "description": "This article of clothing come with six hidden pockets, each of which can store up to 1 lb. Finding these hidden pockets requires a DC 30 Investigation check."}, {"name": "Charmer's Pattern (Exquisite)", "description": "You gain grand mastery in Persuasion."}, {"name": "Brawny Pattern (Exquisite)", "description": "You gain grand mastery in Athletics."}, {"name": "Avoidant Weave (Exquisite)", "description": "This clothing gains the avoidant 3 armor property. If it already has the avoidant armor property, its avoidant number increases to 3."}, {"name": "Animal Handler's Pattern (Exquisite)", "description": "You gain grand mastery in Animal Handling."}, {"name": "Acrobat's Pattern (Exquisite)", "description": "You gain grand mastery in Acrobatics."}, {"name": "Ace Pilot's Pattern (Exquisite)", "description": "You gain grand mastery in Piloting."}
                ],
                "Focus Generator": [
                    {"name": "Withering Channel (Ascendancy)", "description": "This item gains the withering 3 property. If it already has the withering property, its withering number increases to 3."}, {"name": "Storing Emitter (Champion)", "description": "This item gains the storing 6 property. If it already has the storing property, its storing number increases to 6."}, {"name": "Repelling Cycler (Perfect)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater. Additionally, creatures always have disadvantage on ability checks to dispel or interrupt your powers, and when a creatures make an ability check to dispel or interrupt your powers with disadvantage, they must reroll each of the dice once (at your discretion)."}, {"name": "Rending Conductor (Ascendancy)", "description": "This item gains the rending 3 property. If it already has the rending property, its rending number increases to 3."}, {"name": "Ranging Emitter (Ascendancy)", "description": "This item gains the ranging 3 property. If it already has the ranging property, its ranging number increases to 3."}, {"name": "Mitigating Channel (Ancient)", "description": "This item gains the mitigating 6 property. If it already has the mitigating property, its mitigating number increases to 6."}, {"name": "Inflating Conductor (Perfect)", "description": "This item gains the inflating 30 property. If it already has the inflating property, its inflating number increases to 30."}, {"name": "Increasing Cycler (Ancient)", "description": "This item gains the increasing 60 property. If it already has the increasing property, its increasing number increases to 60."}, {"name": "Forged Ferricite Ascendancy Channel", "description": "When you cast a force power of 1st-level or higher that deals damage, you can increase the damage by two and a half times (rounded down) the number of force points spent."}, {"name": "Fading Cycler (Ascendancy)", "description": "This item gains the fading 3 property. If it already has the fading property, its fading number increases to 3."}, {"name": "Extending Cycler (Champion)", "description": "This item gains the extending 30 property. If it already has the extending property, its extending number increases to 30."}, {"name": "Expanding Conductor (Champion)", "description": "This item gains the expanding 30 property. If it already has the expanding property, its expanding number increases to 30."}, {"name": "Enlarging Channel (Perfect)", "description": "This item gains the enlarging 30 property. If it already has the enlarging property, its enlarging number increases to 30."}, {"name": "Elongating Emitter (Ancient)", "description": "This item gains the elongating 30 property. If it already has the elongating property, its elongating number increases to 30."}, {"name": "Dispelling Emitter (Champion)", "description": "This item gains the dispelling 6 property. If it already has the dispelling property, its dispelling number increases to 6."}, {"name": "Constitution Emitter (Champion)", "description": "This item loses the constitution property."}, {"name": "Bolstering Channel (Ancient)", "description": "This item gains the bolstering 12 property. If it already has the bolstering property, its bolstering number increases to 12."}, {"name": "Amplifying Channel (Ascendancy)", "description": "This item gains the amplifying 3 property. If it already has the amplifying property, its amplifying number increases to 3."}, {"name": "Accessing Cycler (Perfect)", "description": "This item gains the accessing 6 property. If it already has the accessing property, its accessing number increases to 6."}, {"name": "Absorbing Conductor (Ancient)", "description": "This item gains the absorbing 12 property. If it already has the absorbing property, its absorbing number increases to 12."}
                ],
                "Lightweapon": [
                    {"name": "Ostrine Crystal (Perfect)", "description": "When you deal damage with this weapon, you deal an additional 1d8 force, lightning, necrotic, poison, psychic, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Krayt Dragon Pearl (Perfect)", "description": "You gain a +3 bonus to damage rolls made with this weapon. Additionally, you gain a +3 bonus to damage rolls you make with force powers when using this weapon as your focus. If the power would damage multiple targets, you can only apply this damage bonus to one of them."}, {"name": "Byrothsis Ancient Cell", "description": "When this weapon is levitated by the Force to deal damage through a class feature or force power you use, it deals additional damage equal to two of its weapon damage dice."}, {"name": "Vicious Ascendancy Hilt", "description": "This weapon gains the vicious 3 property. If it already has the vicious property, its vicious number increases to 3."}, {"name": "Versatile Handle (Champion)", "description": "Prerequisite: Lacks double or two-handed property\n \nThis weapon gains the versatile (2d6) property. If it already has the versatile property, the versatile damage increases by three steps (from 2d4 to 2d6, d10 to 3d4, from d12 to 3d4, or from 2d6 to 3d4)."}, {"name": "Throwing Weapon Hilt (Champion)", "description": "This weapon gains thrown (60/180) property. If it already has the thrown property, the range increases by 30/90."}, {"name": "Stabilizer Ascendancy Cell", "description": "This weapon loses the dexterity property."}, {"name": "Piercing Cell (Devastating)", "description": "This weapon gains the piercing 3 property. If it already has the piercing property, its piercing number increases to 3."}, {"name": "Keen Beam (Devastating)", "description": "This weapon gains the keen 3 property. If it already has the keen property, its keen number increases to 3."}, {"name": "Dire Ascendancy Hilt", "description": "This weapon gains the dire 3 property. If it already has the dire property, its dire number increases to 3."}, {"name": "Damind Crystal (Perfect)", "description": "When you deal damage with this weapon, you can roll a d10 and add the result to the total."}, {"name": "Crossguard Hilt (Champion)", "description": "This weapon gains the defensive 3 property. If it already has the defensive property, its defensive number increases to 3."}, {"name": "Corruption Crystal (Ancient)", "description": "This weapon gains the corruption 18 property. If it already has the corruption property, its corruption number increases to 18."}, {"name": "Brutal Cell (Devastating)", "description": "This weapon gains the brutal 3 property. If it already has the brutal property, its brutal number increases to 3."}, {"name": "Bright Crystal (Ancient)", "description": "This weapon gains the bright 18 property. If it already has the bright property, its bright number increases to 18."}, {"name": "Biting Crystal (Ancient)", "description": "This weapon gains the biting 18 property. If it already has the biting property, its biting number increases to 18."}
                ],
                "Vibroweapon": [
                    {"name": "Vicious Ascendancy Guard", "description": "This weapon gains the vicious 3 property. If it already has the vicious property, its vicious number increases to 3."}, {"name": "Versatile Frame (Champion)", "description": "Prerequisite: Lacks double or two-handed property\n \nThis weapon gains the versatile (2d6) property. If it already has the versatile property, the versatile damage increases by three steps (from 2d4 to 2d6, d10 to 3d4, from d12 to 3d4, or from 2d6 to 3d4)."}, {"name": "Throwing Weapon Guard (Champion)", "description": "This weapon gains thrown (60/180) property. If it already has the thrown property, the range increases by 30/90."}, {"name": "Sonorous Oscillator Mk VI", "description": "This weapon gains the sonorous 18 property. If it already has the sonorous property, its sonorous number increases to 18."}, {"name": "Shocking Oscillator Mk VI", "description": "This weapon gains the shocking 18 property. If it already has the shocking property, its shocking number increases to 18."}, {"name": "Serrated Edge Mk IV", "description": "When you deal damage with this weapon, you can roll a d10 and add the result to the total."}, {"name": "Returning Weapon Guard", "description": "Prerequisite: Thrown property\n \nThis weapon gains the returning property."}, {"name": "Piercing Oscillator (Devastating)", "description": "This weapon gains the piercing 3 property. If it already has the piercing property, its piercing number increases to 3."}, {"name": "Ostrine Edge (Devastating)", "description": "When you deal damage with this weapon, you deal an additional 1d8 acid, cold, fire, lightning, poison, or sonic damage (chosen by the GM when generating this item)."}, {"name": "Neuralizing Oscillator Mk VI", "description": "This weapon gains the neuralizing 18 property. If it already has the neuralizing property, its neuralizing number increases to 18."}, {"name": "Keen Oscillator (Devastating)", "description": "This weapon gains the keen 3 property. If it already has the keen property, its keen number increases to 3."}, {"name": "Dire Ascendancy Guard", "description": "This weapon gains the dire 3 property. If it already has the dire property, its dire number increases to 3."}, {"name": "Defensive Guard (Champion)", "description": "This weapon gains the defensive 3 property. If it already has the defensive property, its defensive number increases to 3."}, {"name": "Compensation Oscillator (Champion)", "description": "This weapon loses the dexterity property."}, {"name": "Brutal Oscillator (Devastating)", "description": "This weapon gains the brutal 3 property. If it already has the brutal property, its brutal number increases to 3."}
                ],
                "Wristpad": [
                    {"name": "Withering Processor (Ascendancy)", "description": "This item gains the withering 3 property. If it already has the withering property, its withering number increases to 3."}, {"name": "Surging Processor Mk VI", "description": "This item gains the surging 6 property. If it already has the surging property, its surging number increases to 6."}, {"name": "Storing Dataport (Champion)", "description": "This item gains the storing 6 property. If it already has the storing property, its storing number increases to 6."}, {"name": "Repelling Motherboard (Prime)", "description": "This item gains the repelling property, but the DC to interrupt or dispel your powers is equal to 10 + the power’s level, or 8 + twice your proficiency bonus + your casting modifier for that power, whichever is greater. Additionally, creatures always have disadvantage on ability checks to dispel or interrupt your powers, and when a creatures make an ability check to dispel or interrupt your powers with disadvantage, they must reroll each of the dice once (at your discretion)."}, {"name": "Rending Amplifier (Ascendancy)", "description": "This item gains the rending 3 property. If it already has the rending property, its rending number increases to 3."}, {"name": "Ranging Dataport (Ascendancy)", "description": "This item gains the ranging 3 property. If it already has the ranging property, its ranging number increases to 3."}, {"name": "Mitigating Processor Mk VI", "description": "This item gains the mitigating 6 property. If it already has the mitigating property, its mitigating number increases to 6."}, {"name": "Inflating Amplifier (Prime)", "description": "This item gains the inflating 30 property. If it already has the inflating property, its inflating number increases to 30."}, {"name": "Increasing Motherboard Mk VI", "description": "This item gains the increasing 60 property. If it already has the increasing property, its increasing number increases to 60."}, {"name": "Fading Motherboard (Ascendancy)", "description": "This item gains the fading 3 property. If it already has the fading property, its fading number increases to 3."}, {"name": "Extending Motherboard (Champion)", "description": "This item gains the extending 30 property. If it already has the extending property, its extending number increases to 30."}, {"name": "Expanding Amplifier (Champion)", "description": "This item gains the expanding 30 property. If it already has the expanding property, its expanding number increases to 30."}, {"name": "Enlarging Processor (Prime)", "description": "This item gains the enlarging 30 property. If it already has the enlarging property, its enlarging number increases to 30."}, {"name": "Elongating Dataport Mk VI", "description": "This item gains the elongating 30 property. If it already has the elongating property, its elongating number increases to 30."}, {"name": "Dispelling Dataport (Champion)", "description": "This item gains the dispelling 6 property. If it already has the dispelling property, its dispelling number increases to 6."}, {"name": "Constitution Dataport (Champion)", "description": "This item loses the constitution property."}, {"name": "Amplifying Processor (Ascendancy)", "description": "This item gains the amplifying 3 property. If it already has the amplifying property, its amplifying number increases to 3."}, {"name": "Accessing Motherboard (Prime)", "description": "This item gains the accessing 6 property. If it already has the accessing property, its accessing number increases to 6."}, {"name": "Absorbing Amplifier Mk VI", "description": "This item gains the absorbing 12 property. If it already has the absorbing property, its absorbing number increases to 12."}
                ]
            }
        }
    ],
    "equipmentList": {
        "Lightweapon": {
            "weaponList": [
                {"Name": "Lightblade", "Type": "Simple Lightweapon", "Property": "Finesse, Hidden, Luminous", "Cost": "375", "Weight": "1.5", "Damage": "1d6 Energy"}, {"Name": "Lightclub", "Type": "Simple Lightweapon", "Property": "Dexterity 11, Heavy, Luminous, Two-handed", "Cost": "1300", "Weight": "04:15:00", "Damage": "1d10 Energy"}, {"Name": "Lightdagger", "Type": "Simple Lightweapon", "Property": "Finesse, Hidden, Light, Luminous, Thrown (range 20/60)", "Cost": "425", "Weight": "1", "Damage": "1d4 Energy"}, {"Name": "Lightsaber", "Type": "Simple Lightweapon", "Property": "Hidden, Luminous, Versatile (2d4)", "Cost": "450", "Weight": "02:25:00", "Damage": "1d6 Energy"}, {"Name": "Lightstaff", "Type": "Simple Lightweapon", "Property": "Dexterity 11, Luminous, Reach, Two-handed", "Cost": "1275", "Weight": "04:25:00", "Damage": "2d4 Energy"}, {"Name": "Sabermace", "Type": "Simple Lightweapon", "Property": "Brutal 1, Dexterity 13, Hidden, Luminous, Versatile (1d10)", "Cost": "950", "Weight": "03:15:00", "Damage": "1d8 Energy"}, {"Name": "Sicklesaber", "Type": "Simple Lightweapon", "Property": "Dexterity 11, Dire 1, Hidden, Light, Luminous", "Cost": "700", "Weight": "1", "Damage": "1d6 Energy"}, {"Name": "Lightbaton", "Type": "Simple Lightweapon", "Property": "Hidden, Light, Luminous", "Cost": "400", "Weight": "01:25:00", "Damage": "1d8 Energy"}, {"Name": "Lightcutlass", "Type": "Simple Lightweapon", "Property": "Dexterity 11, Hidden, Luminous", "Cost": "725", "Weight": "1.5", "Damage": "2d4 Energy"}, {"Name": "Saberspear", "Type": "Simple Lightweapon", "Property": "Luminous, Thrown (range 20/60), Versatile (2d4)", "Cost": "450", "Weight": "2", "Damage": "1d6 Energy"}, {"Name": "Wristsaber", "Type": "Simple Lightweapon", "Property": "Finesse, Fixed, Light, Luminous", "Cost": "375", "Weight": "1", "Damage": "1d4 Energy"}, {"Name": "Bitesaber", "Type": "Martial Lightweapon", "Property": "Biting 13, Hidden, Luminous, Versatile (2d4)", "Cost": "1800", "Weight": "2.5", "Damage": "1d6 Acid"}, {"Name": "Blightsaber", "Type": "Martial Lightweapon", "Property": "Corruption 13, Hidden, Versatile (2d4)", "Cost": "1800", "Weight": "2.5", "Damage": "1d6 Necrotic"}, {"Name": "Brightsaber", "Type": "Martial Lightweapon", "Property": "Bright 13, Hidden, Luminous, Versatile (2d4)", "Cost": "1800", "Weight": "2.5", "Damage": "1d6 Fire"}, {"Name": "Broadsaber", "Type": "Martial Lightweapon", "Property": "Dexterity 13, Dire 1, Luminous, Versatile (1d8)", "Cost": "1000", "Weight": "03:15:00", "Damage": "2d4 Energy"}, {"Name": "Bustersaber", "Type": "Martial Lightweapon", "Property": "Brutal 1, Dexterity 19, Heavy, Keen 1, Luminous, Reach, Two-handed", "Cost": "2900", "Weight": "07:25:00", "Damage": "1d12 Energy"}, {"Name": "Crossguard saber", "Type": "Martial Lightweapon", "Property": "Defensive 1, Dexterity 13, Heavy, Luminous, Versatile (1d10)", "Cost": "725", "Weight": "03:25:00", "Damage": "1d8 Energy"}, {"Name": "Doublesaber", "Type": "Martial Lightweapon", "Property": "Double (1d8 energy), Finesse, Luminous", "Cost": "725", "Weight": "02:25:00", "Damage": "1d8 Energy"}, {"Name": "Doubleshoto", "Type": "Martial Lightweapon", "Property": "Double (1d6 energy), Finesse, Light, Luminous", "Cost": "700", "Weight": "02:15:00", "Damage": "1d6 Energy"}, {"Name": "Dual-phase saber", "Type": "Martial Lightweapon", "Property": "Dexterity 13, Hidden, Luminous, Versatile (1d12), Vicious 1", "Cost": "1250", "Weight": "3", "Damage": "2d4 Energy"}, {"Name": "Great-saber", "Type": "Martial Lightweapon", "Property": "Dexterity 11, Luminous, Two-handed", "Cost": "1725", "Weight": "03:25:00", "Damage": "2d6 Energy"}, {"Name": "Guard shoto", "Type": "Martial Lightweapon", "Property": "Defensive 1, Finesse, Hidden, Light luminous", "Cost": "375", "Weight": "01:25:00", "Damage": "1d4 Energy"}, {"Name": "Lightaxe", "Type": "Martial Lightweapon", "Property": "Dexterity 11, Heavy, Luminous, Two-handed", "Cost": "1550", "Weight": "04:15:00", "Damage": "1d12 Energy"}, {"Name": "Lightfoil", "Type": "Martial Lightweapon", "Property": "Finesse, Hidden, Luminous", "Cost": "475", "Weight": "1.5", "Damage": "1d8 Energy"}, {"Name": "Lightglaive", "Type": "Martial Lightweapon", "Property": "Brutal 1, Dexterity 13, Luminous, Reach, Two-handed", "Cost": "2050", "Weight": "06:15:00", "Damage": "1d10 Energy"}, {"Name": "Lightkatana", "Type": "Martial Lightweapon", "Property": "Dexterity 11, Hidden, Luminous, Piercing 1, Versatile (1d10)", "Cost": "925", "Weight": "03:15:00", "Damage": "1d8 Energy"}, {"Name": "Lightnodachi", "Type": "Martial Lightweapon", "Property": "Dexterity 17, Luminous, Piercing 1, Two-handed, Vicious 1", "Cost": "3050", "Weight": "4.5", "Damage": "3d4 Energy"}, {"Name": "Martial lightsaber", "Type": "Martial Lightweapon", "Property": "Hidden, Luminous, Versatile (1d10)", "Cost": "550", "Weight": "02:25:00", "Damage": "1d8 Energy"}, {"Name": "Pikesaber", "Type": "Martial Lightweapon", "Property": "Dexterity 11, Luminous, Reach, Two-handed", "Cost": "1675", "Weight": "05:25:00", "Damage": "1d10 Energy"}, {"Name": "Saberwhip", "Type": "Martial Lightweapon", "Property": "Finesse, Hidden, Luminous, Reach", "Cost": "750", "Weight": "3.5", "Damage": "1d4 Energy"}, {"Name": "Shotosaber", "Type": "Martial Lightweapon", "Property": "Finesse, Hidden, Light, Luminous", "Cost": "450", "Weight": "1", "Damage": "1d6 Energy"}, {"Name": "Sith saber", "Type": "Martial Lightweapon", "Property": "Dexterity 11, Hidden, Keen 1, Versatile (1d10)", "Cost": "925", "Weight": "03:15:00", "Damage": "2d4 Energy"}, {"Name": "Splitsaber", "Type": "Martial Lightweapon", "Property": "Double (2d4 energy), Interlocking, Luminous", "Cost": "1500", "Weight": "3", "Damage": "2d4 Energy"}, {"Name": "Splitshoto", "Type": "Martial Lightweapon", "Property": "Double (1d8 energy), Interlocking, Light, Luminous", "Cost": "1150", "Weight": "2", "Damage": "1d8 Energy"}, {"Name": "Warsaber", "Type": "Martial Lightweapon", "Property": "Dexterity 15, Reckless 1, Two-handed, Vicious 1", "Cost": "2175", "Weight": "04:25:00", "Damage": "2d6 Energy"}, {"Name": "Chained lightdagger", "Type": "Martial Lightweapon", "Property": "Disarming, Finesse, Luminous, Reach", "Cost": "800", "Weight": "3.5", "Damage": "1d4 Energy"}, {"Name": "Claymoresaber", "Type": "Martial Lightweapon", "Property": "Dexterity 13, Luminous, Two-handed", "Cost": "2300", "Weight": "3.5", "Damage": "3d4 Energy"}, {"Name": "Crosssaber", "Type": "Martial Lightweapon", "Property": "Dexterity 15, Double (2d4 energy), Heavy, Luminous, Reach", "Cost": "1650", "Weight": "05:25:00", "Damage": "2d4 Energy"}, {"Name": "Lightfist", "Type": "Martial Lightweapon", "Property": "Disguised, Disruptive, Fixed, Light, Luminous", "Cost": "650", "Weight": "1.5", "Damage": "1d4 Energy"}, {"Name": "Lightring", "Type": "Martial Lightweapon", "Property": "Finesse, Hidden, Luminous, Returning, Thrown (range 25/75)", "Cost": "575", "Weight": "2", "Damage": "1d6 Energy"}, {"Name": "Lightsaber pike", "Type": "Martial Lightweapon", "Property": "Dexterity 11, Double (1d8 energy), Luminous, Reach", "Cost": "1175", "Weight": "04:25:00", "Damage": "1d8 Energy"}, {"Name": "Phase knife", "Type": "Martial Lightweapon", "Property": "Dexterity 11, Disguised, Hidden, Keen 1, Light, Luminous, Vicious 1", "Cost": "1025", "Weight": "02:15:00", "Damage": "1d4 Energy"}, {"Name": "Retrosaber", "Type": "Martial Lightweapon", "Property": "Dexterity 13, Dire 1, Reckless 1, Versatile (1d10)", "Cost": "950", "Weight": "3", "Damage": "1d8 Energy"}, {"Name": "Saberaxe", "Type": "Martial Lightweapon", "Property": "Luminous", "Cost": "600", "Weight": "1", "Damage": "2d4 Energy"}, {"Name": "Sabergauntlet", "Type": "Martial Lightweapon", "Property": "Finesse, Fixed, Luminous", "Cost": "475", "Weight": "1.5", "Damage": "1d8 Energy"}, {"Name": "Saberstaff", "Type": "Exotic Lightweapon", "Property": "Modal (double-saber and tech-staff)", "Cost": "1375", "Weight": "0", "Damage": "Special"}, {"Name": "Sunsaber", "Type": "Exotic Lightweapon", "Property": "Bright 15, Dexterity 11, Hidden, Specialized (bright), Versatile (2d4)", "Cost": "1875", "Weight": "0", "Damage": "1d6 Fire"}
            ]
        },
        "Blaster": {
            "weaponList":[
                {"Name": "Blaster carbine", "Type": "Simple Blaster", "Property": "Power cell (range 70/280), Reload 16, Two-handed", "Cost": "425", "Weight": "5.5", "Damage": "1d6 Energy"}, {"Name": "Blaster pistol", "Type": "Simple Blaster", "Property": "Power cell (range 50/200), Reload 16", "Cost": "175", "Weight": "2.5", "Damage": "1d6 Energy"}, {"Name": "Bowcaster", "Type": "Simple Blaster", "Property": "Burst 4, Power cell (range 50/200), Reload 4, Strength 13, Two-handed", "Cost": "1150", "Weight": "11.0", "Damage": "1d10 Energy"}, {"Name": "Cryo carbine", "Type": "Simple Blaster", "Property": "Power cell (range 45/180), Reload 12, Two-handed, Vicious 1", "Cost": "1250", "Weight": "6.0", "Damage": "1d6 Cold"}, {"Name": "Cryo pistol", "Type": "Simple Blaster", "Property": "Power cell (range 30/120), Reload 8, Vicious 1", "Cost": "750", "Weight": "2.0", "Damage": "1d4 Cold"}, {"Name": "Disruptor carbine", "Type": "Simple Blaster", "Property": "Disintegrate 13, Power cell (range 60/240), Reload 8, Strength 11, Two-handed", "Cost": "1450", "Weight": "8.5", "Damage": "1d8 Acid"}, {"Name": "Disruptor pistol", "Type": "Simple Blaster", "Property": "Disintegrate 13, Power cell (range 45/180), Reload 12, Strength 11", "Cost": "750", "Weight": "4.5", "Damage": "1d6 Acid"}, {"Name": "Hold-out", "Type": "Simple Blaster", "Property": "Hidden, Light, Power cell (range 30/120), Reload 8", "Cost": "225", "Weight": "0.5", "Damage": "1d4 Energy"}, {"Name": "Incinerator carbine", "Type": "Simple Blaster", "Property": "Dire 1, Disintegrate 13, Power cell (range 60/240), Reload 12, Strength 11, Two-handed", "Cost": "1650", "Weight": "7.5", "Damage": "1d6 Fire"}, {"Name": "Incinerator pistol", "Type": "Simple Blaster", "Property": "Dire 1, Disintegrate 13, Power cell (range 40/160), Reload 16, Strength 11", "Cost": "1250", "Weight": "3.5", "Damage": "1d4 Fire"}, {"Name": "Ion carbine", "Type": "Simple Blaster", "Property": "Power cell (range 60/240), Reload 12, Two-handed", "Cost": "600", "Weight": "6.0", "Damage": "1d4 Ion"}, {"Name": "Ion pistol", "Type": "Simple Blaster", "Property": "Power cell (range 40/160), Reload 16", "Cost": "250", "Weight": "1.0", "Damage": "1d3 Ion"}, {"Name": "Light pistol", "Type": "Simple Blaster", "Property": "Light, Power cell (range 40/160), Reload 8", "Cost": "250", "Weight": "0.5", "Damage": "1d4 Energy"}, {"Name": "Light repeater", "Type": "Simple Blaster", "Property": "Auto, Power cell (range 50/200), Rapid 5, Reload 20, Two-handed", "Cost": "625", "Weight": "6.0", "Damage": "1d6 Energy"}, {"Name": "Light slugpistol", "Type": "Simple Blaster", "Property": "Light, Reload 8, Slug cartridge (range 35/140)", "Cost": "250", "Weight": "1.0", "Damage": "1d4 Kinetic"}, {"Name": "Scattergun", "Type": "Simple Blaster", "Property": "Burst 2, Reload 8, Slug cartridge (range 30/120), Strength 11", "Cost": "625", "Weight": "2.0", "Damage": "1d6 Kinetic"}, {"Name": "Shotgun", "Type": "Simple Blaster", "Property": "Burst 2, Reload 4, Slug cartridge (range 30/120), Strength 11, Two-handed", "Cost": "725", "Weight": "6.5", "Damage": "2d4 Kinetic"}, {"Name": "Slugpistol", "Type": "Simple Blaster", "Property": "Rapid 8, Reload 16, Slug cartridge (range 40/160), Strength 11", "Cost": "325", "Weight": "3.0", "Damage": "1d6 Kinetic"}, {"Name": "Wrist launcher", "Type": "Simple Blaster", "Property": "Fixed, Reload 1, Special (range 30/120)", "Cost": "400", "Weight": "2.0", "Damage": "Special"}, {"Name": "Wristblaster", "Type": "Simple Blaster", "Property": "Disguised, Fixed, Light, Power cell (range 30/120), Reload 8", "Cost": "200", "Weight": "0.5", "Damage": "1d4 Energy"}, {"Name": "Energy bow", "Type": "Simple Blaster", "Property": "Power cell (range 80/320), Mighty, Reload 4, Two-handed", "Cost": "475", "Weight": "4.5", "Damage": "1d6 Energy"}, {"Name": "Energy slingshot", "Type": "Simple Blaster", "Property": "Power cell (range 20/80), Disruptive, Fixed, Mighty, Reload 20, Two-handed", "Cost": "425", "Weight": "4.0", "Damage": "1d4 Energy"}, {"Name": "Lightning carbine", "Type": "Simple Blaster", "Property": "Power cell (range 60/240), Penetrating 6, Reload 12, Strength 11, Two-handed", "Cost": "1150", "Weight": "7.0", "Damage": "1d6 Lightning"}, {"Name": "Lightning pistol", "Type": "Simple Blaster", "Property": "Power cell (range 30/120), Penetrating 8, Reload 16", "Cost": "550", "Weight": "2.0", "Damage": "1d4 Lightning"}, {"Name": "Needler", "Type": "Simple Blaster", "Property": "Slug cartridge (range 30/160), Piercing 1, Reload 12, Silent, Special", "Cost": "475", "Weight": "3.0", "Damage": "1d4 Kinetic"}, {"Name": "Assault cannon", "Type": "Martial Blaster", "Property": "Burst 4, Power cell (range 90/360), Reload 4, Strength 15, Two-handed", "Cost": "1550", "Weight": "15.0", "Damage": "1d12 Energy"}, {"Name": "BKG", "Type": "Martial Blaster", "Property": "Auto, Burst 2, Disintegrate 13, Power cell (range 120/480), Reload 2, Strength 19, Two-handed, Vicious 1", "Cost": "2750", "Weight": "19.0", "Damage": "3d4 Energy"}, {"Name": "Beam rifle", "Type": "Martial Blaster", "Property": "Penetrating 2, Power cell (range 150/600), Reload 2, Strength 15, Two-handed", "Cost": "1850", "Weight": "16.0", "Damage": "2d6 Energy"}, {"Name": "Blaster rifle", "Type": "Martial Blaster", "Property": "Power cell (range 105/420), Reload 12, Two-handed", "Cost": "525", "Weight": "7.5", "Damage": "1d8 Energy"}, {"Name": "Carbine rifle", "Type": "Martial Blaster", "Property": "Auto, Power cell (range 90/360), Rapid 3, Reload 12, Strength 11, Two-handed", "Cost": "925", "Weight": "8.5", "Damage": "1d8 Energy"}, {"Name": "Chaingun", "Type": "Martial Blaster", "Property": "Auto, Rapid 2, Reload 8, Slug cartridge (range 80/320), Strength 13, Two-handed, Vicious 1", "Cost": "1325", "Weight": "10.5", "Damage": "2d4 Kinetic"}, {"Name": "Cryo cannon", "Type": "Martial Blaster", "Property": "Auto, Burst 2, Power cell (range 75/300), Reload 4, Strength 13, Two-handed, Vicious 1", "Cost": "3300", "Weight": "12.5", "Damage": "2d4 Cold"}, {"Name": "Cryo rifle", "Type": "Martial Blaster", "Property": "Power cell (range 50/200), Reload 4, Strength 11, Two-handed, Vicious 1", "Cost": "2400", "Weight": "10.5", "Damage": "2d4 Cold"}, {"Name": "Cycler rifle", "Type": "Martial Blaster", "Property": "Rapid 2, Reload 8, Slug cartridge (range 90/360), Strength 11, Two-handed", "Cost": "825", "Weight": "7.5", "Damage": "1d8 Kinetic"}, {"Name": "Disruptor rifle", "Type": "Martial Blaster", "Property": "Disintegrate 13, Power cell (range 60/240), Reload 4, Strength 13, Two-handed", "Cost": "2900", "Weight": "13.5", "Damage": "1d10 Acid"}, {"Name": "Disruptor sniper", "Type": "Martial Blaster", "Property": "Disintegrate 13, Power cell (range 120/480), Reload 2, Strength 15, Two-handed", "Cost": "3300", "Weight": "15.0", "Damage": "1d12 Acid"}, {"Name": "Flechette cannon", "Type": "Martial Blaster", "Property": "Reload 6, Special (range special), Strength 13, Two-handed", "Cost": "2300", "Weight": "13.0", "Damage": "Special"}, {"Name": "Grenade launcher", "Type": "Martial Blaster", "Property": "Reload 1, Special (range 90/360), Strength 11, Two-handed", "Cost": "1800", "Weight": "11.5", "Damage": "Special"}, {"Name": "Hand BKG", "Type": "Martial Blaster", "Property": "Brutal 1, Disintegrate 13, Keen 1, Power cell (range 50/200), Reload 4, Strength 15", "Cost": "1550", "Weight": "10.0", "Damage": "1d10 Energy"}, {"Name": "Hand blaster", "Type": "Martial Blaster", "Property": "Keen 1, Light, Power cell (range 40/160), Reload 8", "Cost": "500", "Weight": "0.5", "Damage": "1d4 Energy"}, {"Name": "Hand cannon", "Type": "Martial Blaster", "Property": "Brutal 1, Slug cartridge (range 25/100), Reload 8, Strength 11, Two-handed", "Cost": "1300", "Weight": "10.5", "Damage": "1d10 Kinetic"}, {"Name": "Heavy blaster rifle", "Type": "Martial Blaster", "Property": "Power cell (range 100/400), Rapid 2, Reload 8, Strength 13, Two-handed", "Cost": "1025", "Weight": "10.0", "Damage": "2d4 Energy"}, {"Name": "Heavy bowcaster", "Type": "Martial Blaster", "Property": "Burst 2, Power cell (range 90/360), Reload 4, Strength 17, Two-handed", "Cost": "1750", "Weight": "15.5", "Damage": "1d12 Energy"}, {"Name": "Heavy carbine", "Type": "Martial Blaster", "Property": "Power cell (range 60/240), Rapid 4, Reload 16, Strength 11, Two-handed", "Cost": "775", "Weight": "7.5", "Damage": "1d8 Energy"}, {"Name": "Heavy pistol", "Type": "Martial Blaster", "Property": "Power cell (range 45/180), Reload 16", "Cost": "300", "Weight": "4.0", "Damage": "1d8 Energy"}, {"Name": "Heavy repeater", "Type": "Martial Blaster", "Property": "Auto, Burst 4, Power cell (range 80/320), Rapid 4, Reload 8, Strength 13, Two-handed", "Cost": "1225", "Weight": "11.0", "Damage": "2d4 Energy"}, {"Name": "Heavy shotgun", "Type": "Martial Blaster", "Property": "Burst 2, Reload 8, Slug cartridge (range 60/240), Strength 13, Two-handed", "Cost": "1125", "Weight": "9.5", "Damage": "2d4 Kinetic"}, {"Name": "Heavy slugpistol", "Type": "Martial Blaster", "Property": "Rapid 8, Reload 12, Slug cartridge (range 30/120)", "Cost": "375", "Weight": "3.5", "Damage": "1d8 Kinetic"}, {"Name": "Hunting rifle", "Type": "Martial Blaster", "Property": "Reload 4, Slug cartridge (range 125/500), Strength 11, Two-handed", "Cost": "1000", "Weight": "11.0", "Damage": "1d10 Kinetic"}, {"Name": "Incinerator rifle", "Type": "Martial Blaster", "Property": "Dire 1, Disintegrate 13, Power cell (range 80/320), Reload 8, Strength 11, Two-handed", "Cost": "1950", "Weight": "9.5", "Damage": "1d8 Fire"}, {"Name": "Bo-rifle", "Type": "Exotic Blaster", "Property": "Modal (blaster rifle and techstaff)", "Cost": "1075", "Weight": "0", "Damage": "Special"}, {"Name": "IWS", "Type": "Exotic Blaster", "Property": "Modal (blaster rifle, grenade launcher, and sniper rifle)", "Cost": "3625", "Weight": "23", "Damage": "Special"}, {"Name": "Radrifle", "Type": "Exotic Blaster", "Property": "Disintegrate 15, Power cell (range 120/480), Reload 8, Specialized (disintegrate), Strength 13, Two-handed", "Cost": "1575", "Weight": "14", "Damage": "1d6 Necrotic"}
            ]
        },
        "Armor": {
            "weaponList": [
                {"Name": "Assault Armor", "Type": "Heavy", "Property": "Bulky, Strength 15", "Cost": "2000", "Weight": "60", "AC": 17, "Stealth": "Disadvantage"}, {"Name": "Battle Armor", "Type": "Heavy", "Property": "Bulky, Strength 13", "Cost": "750", "Weight": "55", "AC": 16, "Stealth": "Disadvantage"}, {"Name": "Durafiber Battle Armor", "Type": "Heavy", "Property": "Bulky, Strength 11", "Cost": "6750", "Weight": "55", "AC": 15, "Stealth": "Disadvantage"}, {"Name": "Durasteel Exoskeleton", "Type": "Heavy", "Property": "Bulky, Impermeable 2, Rigid, Strength 17", "Cost": "15000", "Weight": "65", "AC": 18, "Stealth": "Disadvantage"}, {"Name": "Heavy Exoskeleton", "Type": "Heavy", "Property": "Bulky, Strength 17", "Cost": "9000", "Weight": "65", "AC": 18, "Stealth": "Disadvantage"}, {"Name": "Laminanium Assault", "Type": "Heavy", "Property": "Bulky, Cumbersome, Obscured, Strength 15", "Cost": "8000", "Weight": "60", "AC": 17, "Stealth": "Disadvantage"}, {"Name": "Combat Suit", "Type": "Light", "Property": "", "Cost": "100", "Weight": "10", "AC": "11 + Dex modifier", "Stealth": "-"}, {"Name": "Duranium Combat Suit", "Type": "Light", "Property": "Cumbersome, Reactive 1", "Cost": "1100", "Weight": "10", "AC": "11 + Dex modifier", "Stealth": "-"}, {"Name": "Duravlex Fiber Armor", "Type": "Light", "Property": "Silent", "Cost": "1450", "Weight": "13", "AC": "11 + Dex modifier", "Stealth": "-"}, {"Name": "Fiber Armor", "Type": "Light", "Property": "", "Cost": "450", "Weight": "13", "AC": "12 + Dex modifier", "Stealth": "-"}, {"Name": "Fleximetal Fiber Armor", "Type": "Light", "Property": "Avoidant 1, Strength 11", "Cost": "1450", "Weight": "13", "AC": "12 + Dex modifier", "Stealth": "-"}, {"Name": "Beskar Weave Armor", "Type": "Medium", "Property": "Regulated, Strength 11", "Cost": "3000", "Weight": "25", "AC": "14 + Dex modifier (max 2)", "Stealth": "-"}, {"Name": "Composite Armor", "Type": "Medium", "Property": "Bulky", "Cost": "2500", "Weight": "45", "AC": "15 + Dex modifier (max 2)", "Stealth": "Disadvantage"}, {"Name": "Mesh Armor", "Type": "Medium", "Property": "", "Cost": "500", "Weight": "20", "AC": "13 + Dex modifier (max 2)", "Stealth": "-"}, {"Name": "Neutronium Mesh", "Type": "Medium", "Property": "Insulated 5, Strength 11", "Cost": "2500", "Weight": "20", "AC": "13 + Dex modifier (max 2)", "Stealth": "-"}, {"Name": "Plastoid Composite", "Type": "Medium", "Property": "Bulky, Reinforced, Rigid", "Cost": "4500", "Weight": "45", "AC": "15 + Dex modifier (max 2)", "Stealth": "Disadvantage"}, {"Name": "Weave Armor", "Type": "Medium", "Property": "", "Cost": "1000", "Weight": "25", "AC": "14 + Dex modifier (max 2)", "Stealth": "-"}, {"Name": "Bone Light Shield", "Type": "Shield", "Property": "Spiked (1d4)", "Cost": "300", "Weight": "0", "AC": 0, "Stealth": "-"}, {"Name": "Crystadium Medium Shield", "Type": "Shield", "Property": "Absorptive 1, Imbalanced, Strength 13", "Cost": "900", "Weight": "18", "AC": 2, "Stealth": "-"}, {"Name": "Heavy Physical Shield", "Type": "Shield", "Property": "Obtrusive, Strength 15", "Cost": "500", "Weight": "36", "AC": 3, "Stealth": "-"}, {"Name": "Heavy Shield Generator", "Type": "Shield", "Property": "", "Cost": "1250", "Weight": "12", "AC": 3, "Stealth": "-"}, {"Name": "Light Physical Shield", "Type": "Shield", "Property": "", "Cost": "50", "Weight": "0", "AC": 1, "Stealth": "-"}, {"Name": "Light Shield Generator", "Type": "Shield", "Property": "", "Cost": "125", "Weight": "0", "AC": 1, "Stealth": "-"}, {"Name": "Medium Physical Shield", "Type": "Shield", "Property": "Strength 13", "Cost": "150", "Weight": "18", "AC": 2, "Stealth": "-"}, {"Name": "Medium Shield Generator", "Type": "Shield", "Property": "", "Cost": "375", "Weight": "0", "AC": 2, "Stealth": "-"}, {"Name": "Quadanium Heavy Shield", "Type": "Shield", "Property": "Charging 1, Cumbersome, Obtrusive, Strength 15", "Cost": "2000", "Weight": "36", "AC": 3, "Stealth": "-"}
            ]
        },
        "Clothing": {
            "weaponList": [
                {
                    "name": "Sunshades",
                    "description": "These shades are worn over the eyes. While worn, you can no longer have disadvantage due to direct sunlight on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight. However, while worn, you have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in dim light.",
                    "cost": "20",
                    "weight": "0"
                },
                {
                    "name": "Clothes, traveler's",
                    "description": "",
                    "cost": "20",
                    "weight": "4"
                },
                {
                    "name": "Clothes, fine",
                    "description": "",
                    "cost": "150",
                    "weight": "6"
                },
                {
                    "name": "Clothes, dress uniform",
                    "description": "",
                    "cost": "100",
                    "weight": "8"
                },
                {
                    "name": "Clothes, costume",
                    "description": "",
                    "cost": "50",
                    "weight": "4"
                },
                {
                    "name": "Clothes, common",
                    "description": "",
                    "cost": "5",
                    "weight": "3"
                },
                {
                    "name": "Clothes, clandestine",
                    "description": "These clothes come with two hidden pockets, each of which can store up to 1.00 lb. Finding these hidden pockets requires a DC 15 Investigation check.",
                    "cost": "300",
                    "weight": "7"
                }
            ]
        },
        "Focus Generator": {
            "weaponList": [
                {"name": "Focus Generator", "description": "A focus generator is a handheld object used to help forcecasters learn to focus on their powers.", "cost": "200", "weight": "1"}
            ]
        },
        "Vibroweapon": {
            "weaponList": [
                {"Name": "Diresword", "Type": "Simple Vibroweapon", "Property": "Dexterity 11, Dire 1, Heavy", "Cost": "300", "Weight": "04:15:00", "Damage": "1d6 Kinetic"}, {"Name": "Nervebaton", "Type": "Simple Vibroweapon", "Property": "Disruptive, Neuralizing 13", "Cost": "375", "Weight": "2", "Damage": "1d4 Kinetic"}, {"Name": "Techaxe", "Type": "Simple Vibroweapon", "Property": "Light, Thrown (range 25/75)", "Cost": "75", "Weight": "1", "Damage": "1d6 Kinetic"}, {"Name": "Vibrodagger", "Type": "Simple Vibroweapon", "Property": "Finesse, Light, Thrown (range 20/60)", "Cost": "50", "Weight": "0.5", "Damage": "1d4 Kinetic"}, {"Name": "Vibrodart", "Type": "Simple Vibroweapon", "Property": "Finesse, Special, Thrown (range 20/60)", "Cost": "5", "Weight": "0.5", "Damage": "1d4 Kinetic"}, {"Name": "Vibroknuckler", "Type": "Simple Vibroweapon", "Property": "Hidden, Light", "Cost": "75", "Weight": "01:25:00", "Damage": "1d6 Kinetic"}, {"Name": "Vibromace", "Type": "Simple Vibroweapon", "Property": "Dexterity 11, Heavy, Two-handed", "Cost": "700", "Weight": "7", "Damage": "1d10 Kinetic"}, {"Name": "Vibrosabre", "Type": "Simple Vibroweapon", "Property": "Dexterity 11, Keen 1, Light", "Cost": "300", "Weight": "02:15:00", "Damage": "1d6 Kinetic"}, {"Name": "Vibrospear", "Type": "Simple Vibroweapon", "Property": "Thrown (range 25/75), Versatile (2d4)", "Cost": "125", "Weight": "4", "Damage": "1d6 Kinetic"}, {"Name": "Vibrostaff", "Type": "Simple Vibroweapon", "Property": "Versatile (2d4)", "Cost": "100", "Weight": "4", "Damage": "1d6 Kinetic"}, {"Name": "Atlatl", "Type": "Simple Vibroweapon", "Property": "Disguised, Light, Special", "Cost": "375", "Weight": "01:25:00", "Damage": "1d6 Kinetic"}, {"Name": "Electroprod", "Type": "Simple Vibroweapon", "Property": "Disruptive, Shocking 13, Two-handed", "Cost": "650", "Weight": "6", "Damage": "1d8 Kinetic"}, {"Name": "Mancatcher", "Type": "Simple Vibroweapon", "Property": "Reach, Special, Two-handed", "Cost": "800", "Weight": "7", "Damage": "1d8 Kinetic"}, {"Name": "Stun gauntlet", "Type": "Simple Vibroweapon", "Property": "Disruptive, Fixed, Shocking 13", "Cost": "400", "Weight": "02:25:00", "Damage": "1d4 Kinetic"}, {"Name": "Vibroclaw", "Type": "Simple Vibroweapon", "Property": "Finesse, Fixed, Light", "Cost": "50", "Weight": "01:15:00", "Damage": "1d4 Kinetic"}, {"Name": "Vibrocutlass", "Type": "Simple Vibroweapon", "Property": "Dexterity 11", "Cost": "600", "Weight": "1", "Damage": "2d4 Kinetic"}, {"Name": "Vibrocutter", "Type": "Simple Vibroweapon", "Property": "Heavy", "Cost": "50", "Weight": "3", "Damage": "1d6 Kinetic"}, {"Name": "Chakram", "Type": "Martial Vibroweapon", "Property": "Finesse, Returning, Thrown (range 30/90)", "Cost": "175", "Weight": "3", "Damage": "1d6 Kinetic"}, {"Name": "Dire vibroblade", "Type": "Martial Vibroweapon", "Property": "Dexterity 13, Dire 1, Versatile (1d10)", "Cost": "550", "Weight": "7", "Damage": "1d8 Kinetic"}, {"Name": "Doubleblade", "Type": "Martial Vibroweapon", "Property": "Double (1d6 kinetic), Finesse, Light", "Cost": "400", "Weight": "3.5", "Damage": "1d6 Kinetic"}, {"Name": "Doublesword", "Type": "Martial Vibroweapon", "Property": "Double (1d8 kinetic), Finesse", "Cost": "450", "Weight": "5.5", "Damage": "1d8 Kinetic"}, {"Name": "Echostaff", "Type": "Martial Vibroweapon", "Property": "Double (1d6 kinetic), Finesse, Sonorous 13", "Cost": "600", "Weight": "5", "Damage": "1d6 Kinetic"}, {"Name": "Electrobaton", "Type": "Martial Vibroweapon", "Property": "Finesse, Light, Shocking 13", "Cost": "275", "Weight": "1", "Damage": "1d4 Kinetic"}, {"Name": "Electrohammer", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Heavy, Shocking 13, Two-handed", "Cost": "950", "Weight": "09:15:00", "Damage": "1d10 Kinetic"}, {"Name": "Electrostaff", "Type": "Martial Vibroweapon", "Property": "Double (1d6 kinetic), Finesse, Shocking 13", "Cost": "600", "Weight": "5", "Damage": "1d6 Kinetic"}, {"Name": "Hidden blade", "Type": "Martial Vibroweapon", "Property": "Finesse, Fixed, Hidden, Light", "Cost": "75", "Weight": "1", "Damage": "1d4 Kinetic"}, {"Name": "Net", "Type": "Martial Vibroweapon", "Property": "Light, Finesse, Special, Thrown (range 15)", "Cost": "300", "Weight": "3", "Damage": "Special"}, {"Name": "Techblade", "Type": "Martial Vibroweapon", "Property": "Finesse, Light", "Cost": "100", "Weight": "1.5", "Damage": "1d6 Kinetic"}, {"Name": "Techstaff", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Double (2d4 kinetic), Light", "Cost": "650", "Weight": "05:25:00", "Damage": "2d4 Kinetic"}, {"Name": "Vibroaxe", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Heavy, Two-handed", "Cost": "950", "Weight": "09:25:00", "Damage": "1d12 Kinetic"}, {"Name": "Vibrobattleaxe", "Type": "Martial Vibroweapon", "Property": "Brutal 1, Dexterity 13, Heavy, Two-handed", "Cost": "1200", "Weight": "10", "Damage": "1d12 Kinetic"}, {"Name": "Vibroblade", "Type": "Martial Vibroweapon", "Property": "Versatile (1d10)", "Cost": "200", "Weight": "5", "Damage": "1d8 Kinetic"}, {"Name": "Vibrobuster", "Type": "Martial Vibroweapon", "Property": "Brutal 1, Dexterity 19, Heavy, Keen 1, Reach, Two-handed", "Cost": "1850", "Weight": "13:25:00", "Damage": "1d12 Kinetic"}, {"Name": "Vibroflail", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Reckless 1", "Cost": "500", "Weight": "05:15:00", "Damage": "2d4 Kinetic"}, {"Name": "Vibroglaive", "Type": "Martial Vibroweapon", "Property": "Brutal 1, Dexterity 13, Reach, Two-handed", "Cost": "1200", "Weight": "10", "Damage": "1d10 Kinetic"}, {"Name": "Vibrohammer", "Type": "Martial Vibroweapon", "Property": "Heavy, Two-handed, Vicious 1", "Cost": "600", "Weight": "7.5", "Damage": "2d4 Kinetic"}, {"Name": "Vibrokatana", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Piercing 1, Versatile (1d10)", "Cost": "450", "Weight": "06:15:00", "Damage": "1d8 Kinetic"}, {"Name": "Vibroknife", "Type": "Martial Vibroweapon", "Property": "Finesse, Light, Piercing 1", "Cost": "225", "Weight": "1", "Damage": "1d4 Kinetic"}, {"Name": "Vibronodachi", "Type": "Martial Vibroweapon", "Property": "Dexterity 17, Piercing 1, Two-handed, Vicious 1", "Cost": "2200", "Weight": "12", "Damage": "3d4 Kinetic"}, {"Name": "Vibropike", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Reach, Two-handed", "Cost": "950", "Weight": "09:25:00", "Damage": "1d10 Kinetic"}, {"Name": "Vibrorapier", "Type": "Martial Vibroweapon", "Property": "Finesse", "Cost": "150", "Weight": "3.5", "Damage": "1d8 Kinetic"}, {"Name": "Vibroshield", "Type": "Martial Vibroweapon", "Property": "Defensive 1, Fixed", "Cost": "325", "Weight": "04:15:00", "Damage": "1d8 Kinetic"}, {"Name": "Vibrostiletto", "Type": "Martial Vibroweapon", "Property": "Finesse, Keen 1, Light, Thrown (range 30/90)", "Cost": "250", "Weight": "1", "Damage": "1d4 Kinetic"}, {"Name": "Vibrosword", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Two-handed", "Cost": "1150", "Weight": "09:25:00", "Damage": "2d6 Kinetic"}, {"Name": "Vibrotonfa", "Type": "Martial Vibroweapon", "Property": "Defensive 1, Finesse, Light", "Cost": "225", "Weight": "1", "Damage": "1d4 Kinetic"}, {"Name": "Vibrowhip", "Type": "Martial Vibroweapon", "Property": "Finesse, Reach", "Cost": "275", "Weight": "3.5", "Damage": "1d4 Kinetic"}, {"Name": "War hat", "Type": "Martial Vibroweapon", "Property": "Defensive 1, Disguised, Returning, Thrown (range 30/90)", "Cost": "350", "Weight": "03:25:00", "Damage": "1d6 Kinetic"}, {"Name": "Warsword", "Type": "Martial Vibroweapon", "Property": "Dexterity 15, Reckless 1, Two-handed, Vicious 1", "Cost": "1650", "Weight": "11:15:00", "Damage": "2d6 Kinetic"}, {"Name": "Bolas", "Type": "Martial Vibroweapon", "Property": "Light, Special, Thrown (range 20/60)", "Cost": "100", "Weight": "2", "Damage": "Special"}, {"Name": "Cesta", "Type": "Martial Vibroweapon", "Property": "Disguised, Double (1d8) finesse, Special", "Cost": "975", "Weight": "06:15:00", "Damage": "1d8 Kinetic"}, {"Name": "Chained dagger", "Type": "Martial Vibroweapon", "Property": "Disarming, Finesse, Reach", "Cost": "350", "Weight": "04:15:00", "Damage": "1d4 Kinetic"}, {"Name": "Disguised blade", "Type": "Martial Vibroweapon", "Property": "Disarming, Disguised, Finesse, Light", "Cost": "125", "Weight": "1", "Damage": "1d4 Kinetic"}, {"Name": "Disruptorshiv", "Type": "Martial Vibroweapon", "Property": "Disruptive, Finesse, Shocking 13", "Cost": "425", "Weight": "2.5", "Damage": "1d4 Kinetic"}, {"Name": "Electrovoulge", "Type": "Martial Vibroweapon", "Property": "Dexterity 13, Reach, Shocking 13, Two-handed", "Cost": "1250", "Weight": "10", "Damage": "1d10 Kinetic"}, {"Name": "Electrowhip", "Type": "Martial Vibroweapon", "Property": "Dexterity 11, Disruptive, Reach, Shocking 13", "Cost": "725", "Weight": "04:25:00", "Damage": "1d4 Kinetic"}, {"Name": "Hooked vibroblade", "Type": "Martial Vibroweapon", "Property": "Disarming, Finesse", "Cost": "225", "Weight": "04:15:00", "Damage": "1d8 Kinetic"}, {"Name": "Jagged vibroblade", "Type": "Martial Vibroweapon", "Property": "Dexterity 13, Keen 1, Versatile (1d12)", "Cost": "650", "Weight": "7", "Damage": "2d4 Kinetic"}, {"Name": "Riot baton", "Type": "Martial Vibroweapon", "Property": "Defensive 1, Light", "Cost": "250", "Weight": "1.5", "Damage": "1d6 Kinetic"}, {"Name": "Riot shocker", "Type": "Martial Vibroweapon", "Property": "Defensive 1, Light, Shocking 13", "Cost": "425", "Weight": "1", "Damage": "1d4 Kinetic"}, {"Name": "Shock whip", "Type": "Martial Vibroweapon", "Property": "Reach, Shocking 13", "Cost": "475", "Weight": "3.5", "Damage": "1d4 Kinetic"}, {"Name": "Vibrobaton", "Type": "Martial Vibroweapon", "Property": "—", "Cost": "250", "Weight": "4", "Damage": "2d4 Kinetic"}, {"Name": "Vibroclaymore", "Type": "Martial Vibroweapon", "Property": "Dexterity 13, Two-handed", "Cost": "1700", "Weight": "10.5", "Damage": "3d4 Kinetic"}, {"Name": "Vibrolance", "Type": "Martial Vibroweapon", "Property": "Dexterity 13, Reach, Special", "Cost": "1500", "Weight": "8.5", "Damage": "1d12 Kinetic"}, {"Name": "Wristblade", "Type": "Martial Vibroweapon", "Property": "Fixed, Light, Piercing 1", "Cost": "275", "Weight": "02:15:00", "Damage": "1d6 Kinetic"}, {"Name": "Bo-rifle", "Type": "Exotic Vibroweapon", "Property": "Modal (blaster rifle and techstaff)", "Cost": "1075", "Weight": "0", "Damage": "Special"}, {"Name": "Neuronic whip", "Type": "Exotic Vibroweapon", "Property": "Reach, Shocking 15, Specialized (shocking)", "Cost": "725", "Weight": "0", "Damage": "1d4 Kinetic"}, {"Name": "Saberstaff", "Type": "Exotic Vibroweapon", "Property": "Modal (double-saber and tech-staff)", "Cost": "1375", "Weight": "0", "Damage": "Special"}
            ]
        },
        "Wristpad": {
            "weaponList": [
                {"name": "Wristpad", "description": "A wristpad is a harness with an integrated datapad and holoprojector interface that fits on the forearm and includes self-charging battery packs.", "cost": "600", "weight": "2"}
            ]
        }
    },
    "equipmentType": [
        "Lightweapon",
        "Blaster",
        "Armor",
        "Clothing",
        "Focus Generator",
        "Vibroweapon",
        "Wristpad"
    ]
}